[
  {
    "title": "Israel says remains Hamas handed over on Tuesday are not those of a Gaza hostage",
    "url": "https://www.straitstimes.com/asia/israel-says-remains-hamas-handed-over-on-tuesday-are-not-those-of-a-gaza-hostage",
    "snippet": "JERUSALEM, Dec 3 - Israeli forensic services concluded that remains handed over by Hamas on Tuesday were not those of the last two hostages in Gaza, the office of Israel's prime minister said.",
    "source": "straitstimes.com",
    "time": "2025-12-03T07:00:18",
    "region": "AMER",
    "severity": 2,
    "type": "DUTY OF CARE"
  },
  {
    "title": "Indonesia’s cyclone tragedy exposes lethal cost of forest destruction",
    "url": "https://www.scmp.com/week-asia/health-environment/article/3334963/indonesias-cyclone-tragedy-exposes-lethal-cost-forest-destruction?utm_source=rss_feed",
    "snippet": "Indonesia is facing renewed calls to curb deforestation and tighten oversight of forest concessions after a rare tropical cyclone tore across Sumatra, unleashing floods and landslides that have killed more than 700 people and left hundreds missing.\nThe disaster has prompted a nationwide debate over whether the tragedy was driven primarily by climate change-fuelled extreme weather or by decades of ecological destruction in a region that has been transformed by plantations, mining and large-scale...",
    "source": "scmp.com",
    "time": "2025-12-03T06:30:09",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Caribbean – Hurricane Melissa (Jamaica)– ETC Dashboard #7: 01 December 2025",
    "url": "https://reliefweb.int/map/jamaica/caribbean-hurricane-melissa-jamaica-etc-dashboard-7-01-december-2025",
    "snippet": "Country: Jamaica Sources: Emergency Telecommunications Cluster, World Food Programme Please refer to the attached Map.",
    "source": "reliefweb.int",
    "time": "2025-12-03T06:03:09",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "China’s move to seal records of offences like drug use sparks public backlash",
    "url": "https://www.scmp.com/news/china/politics/article/3335001/chinas-move-seal-records-minor-offences-drug-use-sparks-public-backlash?utm_source=rss_feed",
    "snippet": "Records of minor offences will be sealed under a new regulation rather than linked to a person’s identity information – a move that is proving unpopular among the public though it has been welcomed by legal experts.\nThe new rule is part of the amended Public Security Administration Punishments Law, which was introduced in 2006 and includes minor offences such as drug use, soliciting prostitutes and minor brawls.\nNational People’s Congress lawmakers approved the revision in June and it will take...",
    "source": "scmp.com",
    "time": "2025-12-03T06:01:53",
    "region": "APJC",
    "severity": 2,
    "type": "COMPLIANCE"
  },
  {
    "title": "Frustration in Indonesia as flood survivors await aid",
    "url": "https://www.straitstimes.com/asia/se-asia/frustration-in-indonesia-as-flood-survivors-await-aid",
    "snippet": "Monsoon rains paired with two rare tropical storm systems dumped record deluges across parts of Indonesia’s Sumatra.",
    "source": "straitstimes.com",
    "time": "2025-12-03T05:05:00",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Sri Lanka: Cyclone Ditwah Joint Rapid Needs Assessment: Phase 1 - Preliminary Scoping, 2 December 2025",
    "url": "https://reliefweb.int/report/sri-lanka/cyclone-ditwah-joint-rapid-needs-assessment-phase-1-preliminary-scoping-2-december-2025",
    "snippet": "Country: Sri Lanka Source: Disaster Management Centre of Sri Lanka Please refer to the attached file. 1.Situation Overview Cyclone Ditwah struck Sri Lanka on 27 November 2025, bringing torrential rains and strong winds that caused severe flooding, landslides, and widespread destruction across all 25 districts. Its slow movement produced prolonged rainfall exceeding 350 mm within 24 hours in some areas, and the rainy conditions continued for four consecutive days, resulting in catastrophic flooding, slope failures, and extensive damage to homes, infrastructure, and livelihoods, making it one of the worst disasters in decades. Although intense rainfall has eased in many districts since 29 November, flooding continues to worsen in several low-lying and downstream areas due to sustained high river discharge, overflow of river basins, and delayed downstream flow even after the rains have subsided. The Department of Irrigation has extended flood warnings for the next 48 hours for the Kelani and Mahaweli River basins, noting that water levels are still rising despite reduced rainfall, while the Meteorology Department has cautioned that runoff from saturated highland catchments will continue moving downstream, prolonging inundation in vulnerable areas.",
    "source": "reliefweb.int",
    "time": "2025-12-03T04:54:09",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "WFP Sri Lanka External Situation Report - 2 December 2025",
    "url": "https://reliefweb.int/report/sri-lanka/wfp-sri-lanka-external-situation-report-2-december-2025",
    "snippet": "Country: Sri Lanka Source: World Food Programme Please refer to the attached file. In Numbers Over 1.5 million people are affected, while 233,015 people are currently sheltered in safety centres. The Government reports 465 confirmed deaths and 366 missing people. Highlights • On 28 November, Cyclonic Storm Ditwah struck Sri Lanka, causing severe floods, landslides, and strong winds. The storm's slow pace led to over 350 mm of rain in some regions within 24 hours. • Although rainfall has subsided, flooding persists in low-lying and downstream areas due to sustained high river discharge, overflow of river basins, and delayed downstream flow. Situation update • Despite a significant reduction in rainfall across the island, the Irrigation Department issued flood warnings cautioning residents living in surrounding areas to remain alert. On 1 December, flood warnings were extended for the Malwathu Oya and Mahaweli River basins, while the water levels in the Kelani river are receding. Residents in landslide-prone hilly areas were cautioned to remain vigilant for signs of slope instability, rock falls, and earth slips. • Markets across the island are heavily impacted, resulting in steep price increases (from 20 to 200 percent) for certain vegetables, largely due to the shortage in supply. Continuous monitoring is ongoing to support food security response. • The Disaster Management Centre (DMC) and the National Disaster Relief Service Centre continue to coordinate search, rescue and relief operations. Tri-forces, police and other civil services also assisting with the evacuation of trapped residents.",
    "source": "reliefweb.int",
    "time": "2025-12-03T04:50:58",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Situation Report - Sri Lanka 3rd December 2025 at 1000hrs",
    "url": "https://reliefweb.int/report/sri-lanka/situation-report-sri-lanka-3rd-december-2025-1000hrs",
    "snippet": "Country: Sri Lanka Source: Disaster Management Centre of Sri Lanka Please refer to the attached file.",
    "source": "reliefweb.int",
    "time": "2025-12-03T04:17:58",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Decades of forest loss hit home: Future cyclones could batter Indonesia harder, analysts warn",
    "url": "https://www.straitstimes.com/asia/se-asia/decades-of-forest-loss-hit-home-future-cyclones-could-batter-indonesia-harder-analysts-warn",
    "snippet": "Deadly floods and landslides across Sumatra have become the first major climate test for President Prabowo.",
    "source": "straitstimes.com",
    "time": "2025-12-03T04:17:00",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Caribbean - Hurricane Melissa (Jamaica) Global ETC Teleconference #07 Date: 28/11/2025 Time: 14:02 UTC",
    "url": "https://reliefweb.int/report/jamaica/caribbean-hurricane-melissa-jamaica-global-etc-teleconference-07-date-28112025-time-1402-utc",
    "snippet": "Country: Jamaica Sources: Emergency Telecommunications Cluster, World Food Programme Please refer to the attached file.",
    "source": "reliefweb.int",
    "time": "2025-12-03T04:03:10",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Why the Philippines’ anti-flood control corruption movement could be receding",
    "url": "https://www.scmp.com/week-asia/politics/article/3334979/fatigue-derailing-philippines-fight-against-flood-control-corruption-scandal?utm_source=rss_feed",
    "snippet": "Thousands of Filipinos have taken to the streets again to protest against the ongoing flood control corruption scandal, yet the markedly smaller crowds compared with the last major demonstration have sparked fears that the movement may be losing momentum.\nPolitical analysts said the low turnout on Sunday reflected a combination of fatigue and disillusionment among activists in the Philippines. They warned that if public mobilisation continued to thin, it could ease the pressure on President...",
    "source": "scmp.com",
    "time": "2025-12-03T03:30:16",
    "region": "AMER",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Jamaica: Hurricane Melissa - Common Operating Picture (COP) as of 01 Dec 2025: 2100L",
    "url": "https://reliefweb.int/map/jamaica/jamaica-hurricane-melissa-common-operating-picture-cop-01-dec-2025-2100l",
    "snippet": "Country: Jamaica Sources: MapAction, World Food Programme Please refer to the attached Map.",
    "source": "reliefweb.int",
    "time": "2025-12-03T03:21:55",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Haiti - Seasonal Monitor: Below-average rainfall in November over Haiti (December 2, 2025)",
    "url": "https://reliefweb.int/report/haiti/haiti-seasonal-monitor-below-average-rainfall-november-over-haiti-december-2-2025",
    "snippet": "Country: Haiti Source: Famine Early Warning System Network Please refer to the attached file. Key Messages Below-average rainfall over Haiti during November 2025. Average rainfall forecast for next seven days suggest average conditions. Below-average rainfall after hurricane Melissa over Haiti Hurricane Melissa brought catastrophic impacts to Haiti in late October, resulting in fatalities and significant damage to infrastructure and cropland. The highest rainfall totals—exceeding 300 percent of the historical average—were reported in Grand'Anse, Sud, Nippes, Sud-Est, Ouest, and L'Artibonite. Over a five-day period, rainfall surpassed 400 mm. The accompanying gusty winds, flooding, and landslides damaged irrigation systems, which could pose a challenge for farmers in the upcoming planting seasons. Since the beginning of November, rainfall has been sporadic and light. This has aided the drainage of flooded areas, replenished water storage in reservoirs, and facilitated crop activity in areas where irrigation systems were not severely affected. As shown in Figure 1, rainfall across most of Haiti for the period of November 11-20 did not exceed 30 percent of the usual amounts, which supports recovery efforts and crop development. Additionally, observed high temperatures are directly related to above-average evapotranspiration rates. The rainfall forecast for next seven days (Figure 2) indicates average conditions for Haiti. This is favorable for agricultural activities and allows for the utilization of excess rainfall following Hurricane Melissa. Temperatures are expected to be slightly above-average, providing some relief to communities engaged in rebuilding infrastructure and production systems.",
    "source": "reliefweb.int",
    "time": "2025-12-03T03:09:49",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "UNFPA Cameroon Situation Report - October 2025 #37: Climate Disaster, Conflict and Displacement",
    "url": "https://reliefweb.int/report/cameroon/unfpa-cameroon-situation-report-october-2025-37-climate-disaster-conflict-and-displacement",
    "snippet": "Country: Cameroon Source: United Nations Population Fund Please refer to the attached file. Cameroon’s humanitarian needs intensified in October as insecurity in the North West, South West, and Far North regions, combined with country-wide lockdowns following the post-electoral crisis, severely restricted movement and access to services. These disruptions limited gender-based violence (GBV) case management, psychosocial support, and antenatal and prenatal care, while also constraining the deployment of integrated mobile clinics. The broader instability has degraded civilian safety and heightened protection risks for women and girls. Despite these constraints, UNFPA and partners sustained essential sexual and reproductive health (SRH) and GBV services. Nearly 6,000 pregnant women accessed antenatal care, over 2,100 facility-based deliveries were supported — including 142 life-saving caesarean sections — and 8,304 people were reached with GBV and SRH awareness campaigns. Almost all GBV survivors received case management, and close to 2,800 women and girls engaged in psychosocial support and skills-building activities, while youth dialogues and community preparedness sessions strengthened social cohesion and resilience. However, critical funding gaps threaten the continuity of these services. As of October, only US$3.5 million of the US$9 million required had been secured, leaving a 61 percent shortfall. This lack of resources directly compromises access to life-saving SRH and GBV assistance and places thousands of vulnerable women and girls at heightened risk, particularly in areas affected by conflict, displacement, and climate shocks.",
    "source": "reliefweb.int",
    "time": "2025-12-03T01:52:36",
    "region": "AMER",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "UNFPA Mali Situation Report - October 2025",
    "url": "https://reliefweb.int/report/mali/unfpa-mali-situation-report-october-2025",
    "snippet": "Country: Mali Source: United Nations Population Fund Please refer to the attached file. Mali’s humanitarian situation deteriorated sharply in October, driven by a nationwide fuel shortage, escalating violence, and tightening restrictions imposed by armed groups. The ban on fuel tanker movements triggered severe operational paralysis, inflating prices and disrupting supply chains, while increased attacks and intimidation further deepened insecurity across central, southern, and northern regions. These overlapping pressures significantly heightened the vulnerability of civilians, especially women and girls. Despite these constraints, UNFPA sustained critical sexual and reproductive health (SRH) and gender-based violence (GBV) services through community midwives, mobile teams, safe spaces, and One Stop Centers. These efforts ensured access to antenatal and postnatal care, assisted deliveries, family planning, psychosocial support, and survivor-centered GBV services, reaching thousands of people even as electricity cuts, mobility restrictions, and suspended activities limited coverage in several areas. However, the response remains gravely underfunded. Only US$5.9 million of the US$16.5 million required has been mobilized, leaving a 64 percent gap that threatens the continuity of life-saving SRH and GBV programmes nationwide. Without urgent resources, essential services for women and girls—including emergency obstetric care, case management, and safe spaces—risk further disruption at a moment when insecurity and access challenges are rapidly intensifying.",
    "source": "reliefweb.int",
    "time": "2025-12-03T01:48:00",
    "region": "AMER",
    "severity": 2,
    "type": "SUPPLY CHAIN"
  },
  {
    "title": "UNFPA Afghanistan: Earthquake in Eastern Region - Situation Report (8 September - 18 October 2025)",
    "url": "https://reliefweb.int/report/afghanistan/unfpa-afghanistan-earthquake-eastern-region-situation-report-8-september-18-october-2025",
    "snippet": "Country: Afghanistan Source: United Nations Population Fund Please refer to the attached file. Women and girls in eastern Afghanistan continue to face escalating risks following the 31 August earthquake, with widespread destruction in Kunar, Nangarhar and Laghman forcing thousands into overcrowded temporary settlements. The combined impacts of displacement, harsh winter conditions, and ongoing returns from neighbouring countries are straining access to essential sexual and reproductive health (SRH) services and heightening exposure to gender-based violence (GBV). More than 55,000 women of reproductive age — including over 3,300 pregnant women — require sustained care, while communication blackouts and rising instability along the Afghanistan–Pakistan border continue to disrupt assistance and limit safe access to support. UNFPA and partners are maintaining life-saving services despite these constraints, operating Mobile Health Teams and Mother and Child Health Centres that remain fully functional and staffed by female providers. Women and girls are receiving antenatal and postnatal care, psychological first aid, GBV response services, dignity kits, and emergency reproductive health supplies. Psychosocial counselling centres in Kunar and Nangarhar are supporting survivors of trauma, while updated GBV referral pathways, community engagement mechanisms, and safety audits are reinforcing protection across affected districts. To scale up SRH and GBV services, replenish emergency stocks, and sustain operations through winter, UNFPA requires US$5 million. To date, US$2 million has been mobilized, including surge staffing support through NORCAP. Additional funding is urgently needed to ensure continuity of essential services for women and girls most at risk.",
    "source": "reliefweb.int",
    "time": "2025-12-03T01:43:35",
    "region": "AMER",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Trump and Lula hold phone call to discuss US tariffs on Brazil, sanctions",
    "url": "https://www.aljazeera.com/news/2025/12/3/trump-and-lula-hold-phone-call-to-discuss-us-tariffs-on-brazil-sanctions?traffic_source=rss",
    "snippet": "US president has warmed to Brazil's left-wing leader since imposing 50 percent tariffs on the South American country.",
    "source": "aljazeera.com",
    "time": "2025-12-03T01:20:09",
    "region": "AMER",
    "severity": 2,
    "type": "COMPLIANCE"
  },
  {
    "title": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit",
    "url": "https://www.bbc.com/news/articles/c058n10727po?at_medium=RSS&at_campaign=rss",
    "snippet": "Fishing boats deliver relief supplies to flooded suburbs as community kitchens churn out food aid.",
    "source": "bbc.com",
    "time": "2025-12-03T00:34:05",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Pope prays at Beirut port blast site on last day of Lebanon visit",
    "url": "https://www.bbc.com/news/articles/cn41jge1990o?at_medium=RSS&at_campaign=rss",
    "snippet": "Pope Leo XIV demanded justice for the more than 200 victims of the disaster, at the end of his three-day visit to Lebanon.",
    "source": "bbc.com",
    "time": "2025-12-02T16:47:19",
    "region": "Global",
    "severity": 2,
    "type": "RESILIENCE / CRISIS"
  },
  {
    "title": "Mirion Medical EC2 Software NMIS BioDose",
    "url": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.7 ATTENTION : Exploitable remotely/low attack complexity Vendor : Mirion Medical Equipment : EC2 Software NMIS BioDose Vulnerabilities : Incorrect Permission Assignment for Critical Resource, Use of Client-Side Authentication, Use of Hard-coded Credentials 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to modify program executables, gain access to sensitive information, gain unauthorized access to the application, and execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Mirion Medical products are affected: EC2 Software NMIS BioDose: Versions prior to 23.0 3.2 VULNERABILITY OVERVIEW 3.2.1 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions' installation directory paths by default have insecure file permissions, which in certain deployment scenarios can enable users on client workstations to modify the program executables and libraries. CVE-2025-64642 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64642 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:L/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous version installations where the embedded Microsoft SQLServer Express is used are exposed in the Windows share accessed by clients in networked installs. By default, this directory has insecure directory paths that allow access to the SQL Server database and configuration files, which can contain sensitive data. CVE-2025-64298 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64298 . A base score of 8.6 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.3 USE OF CLIENT-SIDE AUTHENTICATION CWE-603 NMIS/BioDose V22.02 and previous versions rely on a common SQL Server user account to access data in the database. User access in the client application is restricted by a password authentication check in the client software but the underlying database connection always has access. The latest version of NMIS/BioDose introduces an option to use Windows user authentication with the database, which would restrict this database connection. CVE-2025-61940 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-61940 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.4 USE OF HARD-CODED CREDENTIALS CWE-798 NMIS/BioDose software V22.02 and previous versions contain executable binaries with plain text hard-coded passwords. These hard-coded passwords could allow unauthorized access to both the application and database. CVE-2025-64778 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-64778 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.5 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions rely on a Microsoft SQL Server database. The SQL user account 'nmdbuser' and other created accounts by default have the sysadmin role. This can lead to remote code execution through the use of certain built-in stored procedures. CVE-2025-62575 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-62575 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Joe Dillon reported these vulnerabilities to Mirion Medical. 4. MITIGATIONS Mirion Medical recommends users update to V23.0 or later. Users with an active support contract should update to the latest version through the software or users can contact Mirion Medical support directly. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Industrial Video & Control Longwatch",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Industrial Video & Control Equipment : Longwatch Vulnerability : IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an unauthenticated attacker to gain remote code execution with elevated privileges. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Industrial Video & Control Longwatch, a video surveillance and monitoring system, are affected: Longwatch: Versions 6.309 to 6.334 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94 A vulnerability in Longwatch devices allows unauthenticated HTTP GET requests to execute arbitrary code via an exposed endpoint, due to the absence of code signing and execution controls. Exploitation results in SYSTEM-level privileges. CVE-2025-13658 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13658 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater Systems COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Concerned OT Engineer reported this vulnerability to CISA. 4. MITIGATIONS Industrial Video & Control recommends users running versions 6.309 to 6.334 should upgrade to version 6.335 or later to ensure protection against this vulnerability. For more details, view Industrial Video & Control's advisory . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Iskra iHUB and iHUB Lite",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Iskra Equipment : iHUB and iHUB Lite Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could allow a remote attacker to reconfigure devices, update firmware, and manipulate connected systems without any credentials. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Iskra iHUB and iHUB Lite, a Smart Metering Gateway and Data Concentrator, are affected: iHUB and iHUB Lite: All Versions 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 The Iskra iHUB and iHUB Lite smart metering gateway exposes its web management interface without requiring authentication, allowing unauthenticated users to access and modify critical device settings. CVE-2025-13510 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N ). A CVSS v4 score has also been calculated for CVE-2025-13510 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Slovenia 3.4 RESEARCHER Souvik Kandar reported this vulnerability to CISA. 4. MITIGATIONS Iskra did not respond to CISA's request for coordination. Contact Iskra using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "SiRcom SMART Alert (SiSA)",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-06",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.8 ATTENTION : Exploitable remotely/low attack complexity Vendor : SiRcom Equipment : SMART Alert (SiSA) Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could enable an attacker to remotely activate or manipulate emergency sirens. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of SiRcom SMART Alert (SiSA), a central control system, are affected: SMART Alert (SiSA): Version 3.0.48 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 SiRcom SMART Alert (SiSA) allows unauthorized access to backend APIs. This allows an unauthenticated attacker to bypass the login screen using browser developer tools, gaining access to restricted parts of the application. CVE-2025-13483 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13483 . A base score of 8.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Emergency Services, Government Services and Facilities, Defense Industrial Base COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Souvik Kandar of Microsec (microsec.io) reported this vulnerability to CISA. 4. MITIGATIONS SiRcom did not respond to CISA's request for coordination. Contact SiRcom using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Opto 22 groov View",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-04",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 6.1 ATTENTION : Exploitable remotely/Low attack complexity Vendor : Opto 22 Equipment : groov View Vulnerability : Exposure of Sensitive Information Through Metadata 2. RISK EVALUATION Successful exploitation of this vulnerability could result in credential exposure, key exposure, and privilege escalation. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of groov View are affected: groov View Server for Windows: Versions R1.0a to R4.5d GRV-EPIC-PR1 Firmware: Versions prior to 4.0.3 GRV-EPIC-PR2 Firmware: Versions prior to 4.0.3 3.2 VULNERABILITY OVERVIEW 3.2.1 Exposure of Sensitive Information Through Metadata CWE-1230 The users endpoint in the groov View API returns a list of all users and associated metadata including their API keys. This endpoint requires an Editor role to access and will display API keys for all users, including Administrators. CVE-2025-13084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L ). A CVSS v4 score has also been calculated for CVE-2025-13084 . A base score of 6.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:P/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Nik Tsytsarkin, Ismail Aydemir, and Ryan Hall of Meta reported this vulnerability to CISA. 4. MITIGATIONS Opto 22 has published a patch to address this vulnerability and recommends that users upgrade to groov View Server for Windows Version R4.5e and GRV-EPIC Firmware Version 4.0.3. Additional information is available from Opto 22 here . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, Cobalt Share",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.4 ATTENTION : Low attack complexity Vendor : Ashlar-Vellum Equipment : Cobalt, Xenon, Argon, Lithium, Cobalt Share Vulnerabilities : Out-of-Bounds Write, Heap-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to disclose information or execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Ashlar-Vellum products are affected: Cobalt: Versions 12.6.1204.207 and prior Xenon: Versions 12.6.1204.207 and prior Argon: Versions 12.6.1204.207 and prior Lithium: Versions 12.6.1204.207 and prior Cobalt Share: Versions 12.6.1204.207 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 OUT-OF-BOUNDS WRITE CWE-787 An Out-of-Bounds Write vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65084 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 HEAP-BASED BUFFER OVERFLOW CWE-122 A Heap-based Buffer Overflow vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65085 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65085 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported these vulnerabilities to CISA. 4. MITIGATIONS Ashlar-Vellum recommends users update to the following versions: Cobalt: Versions 12.6.1204.208 or higher Xenon: Versions 12.6.1204.208 or higher Argon: Versions 12.6.1204.208 or higher Lithium: Versions 12.6.1204.208 or higher Cobalt Share: Versions 12.6.1204.208 or higher CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Zenitel TCIV-3+",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-03",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 10.0 ATTENTION: Exploitable remotely/low attack complexity Vendor: Zenitel Equipment: TCIV-3+ Vulnerabilities: OS Command Injection, Out-of-bounds Write, Cross-site Scripting 2. RISK EVALUATION Successful exploitation of these vulnerabilities could result in arbitrary code execution or cause a denial-of-service condition. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of TCIV-3+ are affected: TCIV-3+: All versions prior to 9.3.3.0 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to improper input validation. The application accepts a parameter directly from user input without verifying it is a valid IP address or filtering potentially malicious characters. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64126 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64126 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.2 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to insufficient sanitization of user-supplied input. The application accepts parameters that are later incorporated into OS commands without adequate validation. This could allow an unauthenticated attacker to execute arbitrary commands remotely. CVE-2025-64127 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64127 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.3 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to incomplete validation of user-supplied input. Validation fails to enforce sufficient formatting rules, which could permit attackers to append arbitrary data. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64128 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64128 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.4 OUT-OF-BOUNDS WRITE CWE-787 The affected product is vulnerable to an out-of-bounds write vulnerability, which could allow a remote attacker to crash the device. CVE-2025-64129 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64129 . A base score of 7.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N ). 3.2.5 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79 The affected product is vulnerable to a reflected cross-site scripting vulnerability, which could allow a remote attacker to execute arbitrary JavaScript on the victim's browser. CVE-2025-64130 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64130 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Communications COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Belgium 3.4 RESEARCHER Nir Tepper and Noam Moshe of Claroty Team82 reported these vulnerabilities to CISA. 4. MITIGATIONS Zenitel recommends users to upgrade to Version 9.3.3.0 or later . CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Rockwell Automation Arena Simulation",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.1 ATTENTION : Exploitable from a local network Vendor : Rockwell Automation Equipment : Arena Simulation Vulnerability : Stack-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of this vulnerability could allow local attackers to execute arbitrary code on affected installations of Arena. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Rockwell Automation products are affected: Arena Simulation: Version 16.20.10 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121 Arena suffers from a stack-based buffer overflow vulnerability. The specific flaw exists within the parsing of DOE files. Local attackers are able to exploit this issue to potentially execute arbitrary code on affected installations of Arena. Exploiting the vulnerability requires opening a malicious DOE file. CVE-2025-11918 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.0 has been calculated; the CVSS vector string is ( AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-11918 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:H/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported this vulnerability to CISA. 4. MITIGATIONS Rockwell Automation recommends users upgrade Arena Simulation to version 16.20.11 or later . Users who are unable to upgrade the affected software to a correct version should use Rockwell Automation's security best practices . For more information about this issue, see advisory SD1763 on the Rockwell Automation security page. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Opto 22 GRV-EPIC and groov RIO",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-03",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.5 ATTENTION : Exploitable remotely Vendor : Opto 22 Equipment : GRV-EPIC-PR1, GRV-EPIC-PR2, groov RIO Vulnerability : Improper Neutralization of Special Elements used in an OS Command 2. RISK EVALUATION Successful exploitation of this vulnerability could result in the execution of arbitrary shell commands with root privileges. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of GRV Programmable Logic Controllers are affected: GRV-EPIC-PR1 Firmware: Versions prior to 4.0.3 GRV-EPIC-PR2 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-MM1001-10 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-MM2001-10 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-I1VAPM-3 Firmware: Versions prior to 4.0.3 3.2 VULNERABILITY OVERVIEW 3.2.1 Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') CWE-78 A vulnerability exists in the Opto22 Groov Manage REST API on GRV-EPIC and groov RIO Products that allows remote code execution with root privileges. When a POST request is executed against the vulnerable endpoint, the application reads certain header details and unsafely uses these values to build commands, allowing an attacker with administrative privileges to inject arbitrary commands that execute as root. CVE-2025-13087 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.2 has been calculated; the CVSS vector string is ( AV:N/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-13087 . A base score of 7.5 has been calculated; the CVSS vector string is ( AV:N/AC:H/AT:N/PR:H/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Nik Tsytsarkin, Ismail Aydemir, and Ryan Hall of Meta reported this vulnerability to CISA. 4. MITIGATIONS Opto 22 has published a patch to address this vulnerability and recommends that users upgrade to GRV-EPIC and groov RIO Firmware Version 4.0.3. Additional information is available from Opto 22 here . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolate them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that a VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Festo Didactic products",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-05",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v3 7.8 ATTENTION : Low attack complexity Vendor : Festo SE & Co. KG Equipment : Didactic products Vulnerability : Improper Input Validation 2. RISK EVALUATION Successful exploitation of this vulnerability could allow the creation or overwriting of arbitrary files in the engineering system. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS Festo reports that the following products contain affected versions of Siemens TIA-Portal: Siemens TIA-Portal V15 prior to V17 Update 6 installed on Festo Hardware MES PC: All versions Siemens TIA-Portal V18 prior to V18 Update 1 installed on Festo Hardware MES PC: All versions Siemens TIA-Portal V15 prior to V17 Update 6 installed on Festo Hardware TP260 (<June2023): All versions Siemens TIA-Portal V18 prior to V18 Update 1 installed on Festo Hardware TP260 (<June2023): All versions 3.2 VULNERABILITY OVERVIEW 3.2.1 Improper Input Validation CWE-20 A vulnerability has been identified in Siemens Totally Integrated Automation Portal (TIA Portal) V15, V16, V17, and V18. The affected products contain a path traversal vulnerability that could allow the creation or overwriting of arbitrary files in the engineering system. If the user is tricked into opening a malicious PC system configuration file, an attacker could exploit this vulnerability to achieve arbitrary code execution. CVE-2023-26293 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( CVSS:3.1/AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities, Communications, Critical Manufacturing, Energy COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Germany 3.4 RESEARCHER Festo coordinated this vulnerability with CERT@VDE. 4. MITIGATIONS Festo recommends users of affected devices update TIA-Portal. Refer to Siemens SSA-116924 for more details. For more information, see the associated Festo SE & Co. KG security advisory FSA-202303 FSA-202303: Festo: Vulnerable Siemens TIA-Portal in multiple Festo Didactic products - HTML and FSA-202303: Festo: Vulnerable Siemens TIA-Portal in multiple Festo Didactic products - CSAF . CISA recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 20, 2025: Initial Republication of Festo FSA-202303",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "EMEA",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "Automated Logic WebCTRL Premium Server",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.6 ATTENTION : Low attack complexity Vendor : Automated Logic Equipment : WebCTRL Premium Server Vulnerabilities : Open Redirect, Cross-site Scripting 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow a remote attacker to deceive a legitimate user into running malicious scripts or redirecting them to malicious websites. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Automated Logic products are affected: Automated Logic WebCTRL Server: Version 6.1 Automated Logic WebCTRL Server: Version 7.0 Automated Logic WebCTRL Server: Version 8.0 Automated Logic WebCTRL Server: Version 8.5 Carrier i-Vu: Version 6.1 Carrier i-Vu: Version 7.0 Carrier i-Vu: Version 8.0 Carrier i-Vu: Version 8.5 Automated Logic SiteScan Web: Version 6.1 Automated Logic SiteScan Web: Version 7.0 Automated Logic SiteScan Web: Version 8.0 Automated Logic SiteScan Web: Version 8.5 Automated Logic WebCTRL for OEMs: Version 6.1 Automated Logic WebCTRL for OEMs: Version 7.0 Automated Logic WebCTRL for OEMs: Version 8.0 Automated Logic WebCTRL for OEMs: Version 8.5 3.2 Vulnerability Overview 3.2.1 URL Redirection to Untrusted Site ('Open Redirect') CWE-601 This weakness occurs when an application accepts a user-supplied URL and redirects the user to that URL without proper validation. Attackers can exploit this to redirect victims to malicious sites, often used in phishing or to bypass security controls. CVE-2024-8527 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.3 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2024-8527 . A base score of 8.6 has been calculated; the CVSS vector string is ( CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:L ). 3.2.2 Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') CWE-79 Automated Logic WebCTRL could allow an attacker to send a malicious script to an unsuspecting user due to the \"wbs\" GET parameter not being sanitized. The application includes untrusted data in a web page without proper validation or escaping, allowing attackers to execute malicious scripts in the user's browser. CVE-2024-8528 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is ( AV:L/AC:H/PR:L/UI:R/S:C/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2024-8528 . A base score of 5.4 has been calculated; the CVSS vector string is ( CVSS4.0/AV:L/AC:H/AT:P/PR:L/UI:P/VC:H/VI:H/VA:H/SC:L/SI:L/SA:L ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Jaryl Low, Thuy D. Nguyen, and Cynthia E. Irvine reported these vulnerabilities to CISA. 4. MITIGATIONS Automated Logic has reported the following: Users are advised to upgrade to the latest available version. These vulnerabilities have been remediated in Web CTRL 9.0. Web CTRL 7.0, Web CTRL 6.1, i-Vu 6.0 are out of support. Additionally, Users are encouraged to follow Automated Logic's [Security Best Practices Checklists for Building Automation Systems (BAS)]( https://www.automatedlogic.com/en/media/Security Best Practices for a WebCTRL v8.0 system-522_tcm702-168128.pdf) to ensure alignment with best practices installation guidelines. For more information, visit Carrier's security advisories: https://www.corporate.carrier.com/product-security/advisories-resources/ CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "SITE SECURITY"
  },
  {
    "title": "ICAM365 CCTV Camera Multiple Models",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.0 ATTENTION : Low attack complexity Vendor : iCam365 Equipment : P201 and QC021 Vulnerabilities : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of these vulnerabilities could result in unauthorized exposure of camera video streams and camera configuration data. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following iCam365 camera model is affected: ROBOT PT Camera P201: Versions 43.4.0.0 and prior Night Vision Camera QC021: Versions 43.4.0.0 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 The affected products allow unauthenticated access to Open Network Video Interface Forum (ONVIF) services, which may allow an attacker unauthorized access to camera configuration information. CVE-2025-64770 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is ( AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L ). A CVSS v4 score has also been calculated for CVE-2025-64770 . A base score of 7.0 has been calculated; the CVSS vector string is ( AV:A/AC:L/AT:N/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N ). 3.2.2 Missing Authentication for Critical Function CWE-306 The affected product allows unauthenticated access to Real Time Streaming Protocol (RTSP) services, which may allow an attacker unauthorized access to camera configuration information. CVE-2025-62674 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.8 has been calculated; the CVSS vector string is ( AV:A/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L ). A CVSS v4 score has also been calculated for CVE-2025-62674 . A base score of 7.0 has been calculated; the CVSS vector string is ( AV:A/AC:L/AT:N/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Commercial Facilities COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: China 3.4 RESEARCHER Truong Nguyen Long reported these vulnerabilities to CISA. 4. MITIGATIONS iCam365 did not respond to CISA's request for coordination. Contact iCam365 directly for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that VPNs are only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "APJC",
    "severity": 2,
    "type": "SITE SECURITY"
  }
]