[
  {
    "title": "Israel says remains Hamas handed over on Tuesday are not those of a Gaza hostage",
    "url": "https://www.straitstimes.com/asia/israel-says-remains-hamas-handed-over-on-tuesday-are-not-those-of-a-gaza-hostage",
    "snippet": "JERUSALEM, Dec 3 - Israeli forensic services concluded that remains handed over by Hamas on Tuesday were not those of the last two hostages in Gaza, the office of Israel's prime minister said.",
    "source": "straitstimes.com",
    "time": "2025-12-03T07:05:33",
    "region": "EMEA",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Indonesia’s cyclone tragedy exposes lethal cost of forest destruction",
    "url": "https://www.scmp.com/week-asia/health-environment/article/3334963/indonesias-cyclone-tragedy-exposes-lethal-cost-forest-destruction?utm_source=rss_feed",
    "snippet": "Indonesia is facing renewed calls to curb deforestation and tighten oversight of forest concessions after a rare tropical cyclone tore across Sumatra, unleashing floods and landslides that have killed more than 700 people and left hundreds missing.\nThe disaster has prompted a nationwide debate over whether the tragedy was driven primarily by climate change-fuelled extreme weather or by decades of ecological destruction in a region that has been transformed by plantations, mining and large-scale...",
    "source": "scmp.com",
    "time": "2025-12-03T06:30:09",
    "region": "Global",
    "severity": 2,
    "type": "CRISIS / WEATHER"
  },
  {
    "title": "China wife of gay husband contests estate against his lover, parents after man’s death",
    "url": "https://www.scmp.com/news/people-culture/gender-diversity/article/3334358/china-wife-gay-husband-contests-estate-against-his-lover-and-parents-after-mans-death?utm_source=rss_feed",
    "snippet": "A gay man in northern China who married his boyfriend’s sister to secure relocation compensation died in a traffic accident, sparking a bitter dispute over his estate between his wife, his lover and his parents.\nXu Tian, a 48-year-old Beijing native and senior executive at a state-owned company, had been in a 10-year relationship with his boyfriend, Xue Chong, a doctor two years his junior.\nNeighbours said the gay couple often posed as father and son in public.\nBoth families knew about their...",
    "source": "scmp.com",
    "time": "2025-12-03T06:00:10",
    "region": "APJC",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Taiwan says China sometimes stages mock attacks on foreign navy ships in strait",
    "url": "https://www.straitstimes.com/asia/east-asia/taiwan-says-china-sometimes-stages-mock-attacks-on-foreign-navy-ships-in-strait",
    "snippet": "China says it alone exercises sovereignty and jurisdiction over the major trade route.",
    "source": "straitstimes.com",
    "time": "2025-12-03T05:20:14",
    "region": "APJC",
    "severity": 2,
    "type": "SUPPLY CHAIN"
  },
  {
    "title": "Cyclone catastrophe in Sri Lanka awakens volunteer spirit",
    "url": "https://www.bbc.com/news/articles/c058n10727po?at_medium=RSS&at_campaign=rss",
    "snippet": "Fishing boats deliver relief supplies to flooded suburbs as community kitchens churn out food aid.",
    "source": "bbc.com",
    "time": "2025-12-03T00:34:05",
    "region": "Global",
    "severity": 2,
    "type": "CRISIS / WEATHER"
  },
  {
    "title": "Was it coup or was it a 'sham'? Behind Guinea-Bissau's military takeover",
    "url": "https://www.bbc.com/news/articles/c1m8nm22785o?at_medium=RSS&at_campaign=rss",
    "snippet": "The military has taken over but some say the overthrow of the president was not what it seemed.",
    "source": "bbc.com",
    "time": "2025-12-03T00:07:23",
    "region": "Global",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Shai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets",
    "url": "https://www.bleepingcomputer.com/news/security/shai-hulud-20-npm-malware-attack-exposed-up-to-400-000-dev-secrets/",
    "snippet": "The second Shai-Hulud attack last week exposed around 400,000 raw secrets after infecting hundreds of packages in the NPM (Node Package Manager) registry and publishing stolen data in 30,000 GitHub repositories. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T19:06:20",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Nigeria grants asylum to Guinea-Bissau presidential candidate after coup",
    "url": "https://www.bbc.com/news/articles/ce3wq2zznz1o?at_medium=RSS&at_campaign=rss",
    "snippet": "Nigeria says it is sheltering Fernando Dias in its embassy in Bissau, citing an imminent threat to his life.",
    "source": "bbc.com",
    "time": "2025-12-02T16:51:10",
    "region": "Global",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-theft-after-oracle-ebs-hack/",
    "snippet": "​The University of Pennsylvania (Penn) has confirmed a new data breach after attackers stole documents containing personal information from its Oracle E-Business Suite servers in August. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T12:55:59",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Releases Five Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-releases-five-industrial-control-systems-advisories",
    "snippet": "CISA released five Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-336-01 Industrial Video & Control Longwatch ICSA-25-336-02 Iskra iHUB and iHUB Lite ICSMA-25-336-01 Mirion Medical EC2 Software NMIS BioDose ICSA-25-201-01 Mitsubishi Electric CNC Series (Update A) ICSA-23-157-02 Mitsubishi Electric MELSEC iQ-R Series/iQ-F Series (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Releases Six Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/20/cisa-releases-six-industrial-control-systems-advisories",
    "snippet": "CISA released six Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-324-01 Automated Logic WebCTRL Premium Server ICSA-25-324-02 ICAM365 CCTV Camera Multiple Models ICSA-25-324-03 Opto 22 GRV-EPIC and GRV-RIO ICSA-25-324-04 Festo MSE6-C2M/D2M/E2M ICSA-25-324-05 Festo Didactic products ICSA-25-324-06 Emerson Appleton UPSMON-PRO CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  }
]