[
  {
    "title": "Decades of forest loss hit home: Future cyclones could batter Indonesia harder, analysts warn",
    "url": "https://www.straitstimes.com/asia/se-asia/decades-of-forest-loss-hit-home-future-cyclones-could-batter-indonesia-harder-analysts-warn",
    "snippet": "Deadly floods and landslides across Sumatra have become the first major climate test for President Prabowo.",
    "source": "straitstimes.com",
    "time": "2025-12-03T04:17:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Colombia’s Petro invites Trump to cocaine lab demolition amid attack threat",
    "url": "https://www.aljazeera.com/news/2025/12/3/colombias-petro-invites-trump-to-cocaine-lab-demolition-amid-attack-threat?traffic_source=rss",
    "snippet": "Colombian president chides Trump, saying 18,400 cocaine laboratories have been destroyed 'without missiles' fired.",
    "source": "aljazeera.com",
    "time": "2025-12-03T03:47:49",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Why the Philippines’ anti-flood control corruption movement could be receding",
    "url": "https://www.scmp.com/week-asia/politics/article/3334979/fatigue-derailing-philippines-fight-against-flood-control-corruption-scandal?utm_source=rss_feed",
    "snippet": "Thousands of Filipinos have taken to the streets again to protest against the ongoing flood control corruption scandal, yet the markedly smaller crowds compared with the last major demonstration have sparked fears that the movement may be losing momentum.\nPolitical analysts said the low turnout on Sunday reflected a combination of fatigue and disillusionment among activists in the Philippines. They warned that if public mobilisation continued to thin, it could ease the pressure on President...",
    "source": "scmp.com",
    "time": "2025-12-03T03:30:16",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Jamaica: Hurricane Melissa - Common Operating Picture (COP) as of 01 Dec 2025: 2100L",
    "url": "https://reliefweb.int/map/jamaica/jamaica-hurricane-melissa-common-operating-picture-cop-01-dec-2025-2100l",
    "snippet": "Country: Jamaica Sources: MapAction, World Food Programme Please refer to the attached Map.",
    "source": "reliefweb.int",
    "time": "2025-12-03T03:21:55",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "US defence chief says he did not see survivors before follow-up boat strike",
    "url": "https://www.aljazeera.com/news/2025/12/3/us-defence-chief-says-he-did-not-see-survivors-before-follow-up-boat-strike?traffic_source=rss",
    "snippet": "US Secretary of Defense Peter Hegseth defends controversial second strike on alleged drug boat in the Caribbean Sea.",
    "source": "aljazeera.com",
    "time": "2025-12-03T02:52:21",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UNFPA Mali Situation Report - October 2025",
    "url": "https://reliefweb.int/report/mali/unfpa-mali-situation-report-october-2025",
    "snippet": "Country: Mali Source: United Nations Population Fund Please refer to the attached file. Mali’s humanitarian situation deteriorated sharply in October, driven by a nationwide fuel shortage, escalating violence, and tightening restrictions imposed by armed groups. The ban on fuel tanker movements triggered severe operational paralysis, inflating prices and disrupting supply chains, while increased attacks and intimidation further deepened insecurity across central, southern, and northern regions. These overlapping pressures significantly heightened the vulnerability of civilians, especially women and girls. Despite these constraints, UNFPA sustained critical sexual and reproductive health (SRH) and gender-based violence (GBV) services through community midwives, mobile teams, safe spaces, and One Stop Centers. These efforts ensured access to antenatal and postnatal care, assisted deliveries, family planning, psychosocial support, and survivor-centered GBV services, reaching thousands of people even as electricity cuts, mobility restrictions, and suspended activities limited coverage in several areas. However, the response remains gravely underfunded. Only US$5.9 million of the US$16.5 million required has been mobilized, leaving a 64 percent gap that threatens the continuity of life-saving SRH and GBV programmes nationwide. Without urgent resources, essential services for women and girls—including emergency obstetric care, case management, and safe spaces—risk further disruption at a moment when insecurity and access challenges are rapidly intensifying.",
    "source": "reliefweb.int",
    "time": "2025-12-03T01:48:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Barcelona extend lead at top of La Liga with 3-1 win over Atletico Madrid",
    "url": "https://www.aljazeera.com/sports/2025/12/2/barcelona-extend-lead-at-top-of-la-liga-with-3-1-win-over-atletico-madrid?traffic_source=rss",
    "snippet": "Barca recover from a goal down to win, with strikes from Raphinha, Dani Olmo and Ferran Torres.",
    "source": "aljazeera.com",
    "time": "2025-12-02T22:33:45",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Shai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets",
    "url": "https://www.bleepingcomputer.com/news/security/shai-hulud-20-npm-malware-attack-exposed-up-to-400-000-dev-secrets/",
    "snippet": "The second Shai-Hulud attack last week exposed around 400,000 raw secrets after infecting hundreds of packages in the NPM (Node Package Manager) registry and publishing stolen data in 30,000 GitHub repositories. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T19:06:20",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Nigeria grants asylum to Guinea-Bissau presidential candidate after coup",
    "url": "https://www.bbc.com/news/articles/ce3wq2zznz1o?at_medium=RSS&at_campaign=rss",
    "snippet": "Nigeria says it is sheltering Fernando Dias in its embassy in Bissau, citing an imminent threat to his life.",
    "source": "bbc.com",
    "time": "2025-12-02T16:51:10",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Pope prays at Beirut port blast site on last day of Lebanon visit",
    "url": "https://www.bbc.com/news/articles/cn41jge1990o?at_medium=RSS&at_campaign=rss",
    "snippet": "Pope Leo XIV demanded justice for the more than 200 victims of the disaster, at the end of his three-day visit to Lebanon.",
    "source": "bbc.com",
    "time": "2025-12-02T16:47:19",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "US Navy admiral ordered second  deadly Venezuela boat strike, White House says",
    "url": "https://www.bbc.com/news/articles/c0r95q9kv1go?at_medium=RSS&at_campaign=rss",
    "snippet": "The strikes, authorised by Defence Secretary Pete Hegseth, have raised fresh legality questions - but the White House says laws have been followed.",
    "source": "bbc.com",
    "time": "2025-12-02T15:38:06",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Cybercrime Goes SaaS: Renting Tools, Access, and Infrastructure",
    "url": "https://www.bleepingcomputer.com/news/security/cybercrime-goes-saas-renting-tools-access-and-infrastructure/",
    "snippet": "Cybercrime has fully shifted to a subscription model, with phishing kits, Telegram OTP bots, infostealer logs, and even RATs now rented like SaaS tools. Varonis explains how this \"crime-as-a-service\" economy lowers the barrier to entry and gives low-skill attackers on-demand access to advanced capabilities. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T15:10:20",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Google fixes two Android zero days exploited in attacks, 107 flaws",
    "url": "https://www.bleepingcomputer.com/news/security/google-fixes-two-android-zero-days-exploited-in-attacks-107-flaws/",
    "snippet": "Google has released the December 2025 Android security bulletin, addressing 107 vulnerabilities, including two flaws actively exploited in targeted attacks. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T14:36:44",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-theft-after-oracle-ebs-hack/",
    "snippet": "​The University of Pennsylvania (Penn) has confirmed a new data breach after attackers stole documents containing personal information from its Oracle E-Business Suite servers in August. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T12:55:59",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "CISA Releases Five Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-releases-five-industrial-control-systems-advisories",
    "snippet": "CISA released five Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-336-01 Industrial Video & Control Longwatch ICSA-25-336-02 Iskra iHUB and iHUB Lite ICSMA-25-336-01 Mirion Medical EC2 Software NMIS BioDose ICSA-25-201-01 Mitsubishi Electric CNC Series (Update A) ICSA-23-157-02 Mitsubishi Electric MELSEC iQ-R Series/iQ-F Series (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Pavarotti statue frozen knee-deep in ice rink strikes wrong note in Italy",
    "url": "https://www.bbc.com/news/articles/cre3q9edqx8o?at_medium=RSS&at_campaign=rss",
    "snippet": "The opera legend's widow said the town had made an \"absurd decision\" after it also encouraged skaters to high five the statue.",
    "source": "bbc.com",
    "time": "2025-12-02T05:19:12",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Charities offered latest insight into key cyber threats to help keep out attackers",
    "url": "https://www.ncsc.gov.uk/news/charities-offered-latest-insight-into-key-cyber-threats-to-help-keep-out-attackers",
    "snippet": "Latest report published by the NCSC outlines key threats facing the UK charity sector.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-29T15:25:42",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UK experiencing four 'nationally significant' cyber attacks every week",
    "url": "https://www.ncsc.gov.uk/news/uk-experiencing-four-nationally-significant-cyber-attacks-weekly",
    "snippet": "Latest Annual Review reveals that the cyber threats facing the UK continue to escalate.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-16T13:13:35",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  }
]