[
  {
    "title": "China wife of gay husband contests estate against his lover, parents after man’s death",
    "url": "https://www.scmp.com/news/people-culture/gender-diversity/article/3334358/china-wife-gay-husband-contests-estate-against-his-lover-and-parents-after-mans-death?utm_source=rss_feed",
    "snippet": "A gay man in northern China who married his boyfriend’s sister to secure relocation compensation died in a traffic accident, sparking a bitter dispute over his estate between his wife, his lover and his parents.\nXu Tian, a 48-year-old Beijing native and senior executive at a state-owned company, had been in a 10-year relationship with his boyfriend, Xue Chong, a doctor two years his junior.\nNeighbours said the gay couple often posed as father and son in public.\nBoth families knew about their...",
    "source": "scmp.com",
    "time": "2025-12-03T06:00:10",
    "region": "APJC",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Shai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets",
    "url": "https://www.bleepingcomputer.com/news/security/shai-hulud-20-npm-malware-attack-exposed-up-to-400-000-dev-secrets/",
    "snippet": "The second Shai-Hulud attack last week exposed around 400,000 raw secrets after infecting hundreds of packages in the NPM (Node Package Manager) registry and publishing stolen data in 30,000 GitHub repositories. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T19:06:20",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Nigeria grants asylum to Guinea-Bissau presidential candidate after coup",
    "url": "https://www.bbc.com/news/articles/ce3wq2zznz1o?at_medium=RSS&at_campaign=rss",
    "snippet": "Nigeria says it is sheltering Fernando Dias in its embassy in Bissau, citing an imminent threat to his life.",
    "source": "bbc.com",
    "time": "2025-12-02T16:51:10",
    "region": "Global",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-theft-after-oracle-ebs-hack/",
    "snippet": "​The University of Pennsylvania (Penn) has confirmed a new data breach after attackers stole documents containing personal information from its Oracle E-Business Suite servers in August. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T12:55:59",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Releases Five Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-releases-five-industrial-control-systems-advisories",
    "snippet": "CISA released five Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-336-01 Industrial Video & Control Longwatch ICSA-25-336-02 Iskra iHUB and iHUB Lite ICSMA-25-336-01 Mirion Medical EC2 Software NMIS BioDose ICSA-25-201-01 Mitsubishi Electric CNC Series (Update A) ICSA-23-157-02 Mitsubishi Electric MELSEC iQ-R Series/iQ-F Series (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Active exploitation of vulnerability affecting Oracle E-Business Suite",
    "url": "https://www.ncsc.gov.uk/news/active-exploitation-vulnerability-affecting-oracle-ebusiness-suite",
    "snippet": "The NCSC is encouraging UK organisations to take immediate action to mitigate a vulnerability (CVE-2025-61882) affecting Oracle E-Business Suite.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-06T09:30:52",
    "region": "EMEA",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "NCSC warns of persistent malware campaign targeting Cisco devices",
    "url": "https://www.ncsc.gov.uk/news/persistent-malicious-targeting-cisco-devices",
    "snippet": "Latest malware analysis report helps organisations detect and mitigate malicious activity targeting certain Cisco devices.",
    "source": "ncsc.gov.uk",
    "time": "2025-09-25T11:55:28",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Active exploitation of vulnerability affecting Microsoft Office SharePoint Server products in the UK",
    "url": "https://www.ncsc.gov.uk/news/active-exploitation-of-vulnerability-affecting-microsoft-office-sharepoint-server-products-in-the-uk",
    "snippet": "The NCSC is encouraging UK organisations to take immediate action to mitigate a vulnerability (CVE-2025-53770) affecting Microsoft SharePoint Server products.",
    "source": "ncsc.gov.uk",
    "time": "2025-07-22T08:44:33",
    "region": "EMEA",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "UK and allies expose Russian intelligence campaign targeting western logistics and technology organisations",
    "url": "https://www.ncsc.gov.uk/news/uk-partners-expose-russian-intelligence-campaign",
    "snippet": "Organisations urged to familiarise themselves with the threat and take immediate action to protect themselves.",
    "source": "ncsc.gov.uk",
    "time": "2025-05-22T15:23:34",
    "region": "EMEA",
    "severity": 2,
    "type": "SUPPLY CHAIN"
  }
]