[
  {
    "title": "Australian Man Sentenced to Prison for Wi-Fi Attacks at Airports and on Flights",
    "url": "https://www.securityweek.com/australian-man-sentenced-to-prison-for-wi-fi-attacks-at-airports-and-on-flights/",
    "snippet_raw": "Michael Clapsis has been sentenced to 7 years and 4 months in prison for stealing sensitive information. The post Australian Man Sentenced to Prison for Wi-Fi Attacks at Airports and on Flights appeared first on SecurityWeek .",
    "source": "www.securityweek.com",
    "time": "2025-12-01T09:03:07+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Cybercrime",
      "Mobile & Wireless",
      "Australia",
      "evil twin",
      "hacker",
      "Michale Clapsis",
      "sentenced",
      "Wi-Fi",
      "wireless"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Michael Clapsis has been sentenced to 7 years and 4 months in prison for stealing sensitive information. The post Australian Man Sentenced to Prison for Wi-Fi Attacks at Airports and on Flights appeared first on SecurityWeek ."
  },
  {
    "title": "CISA Adds Actively Exploited XSS Bug CVE-2021-26829 in OpenPLC ScadaBR to KEV",
    "url": "https://thehackernews.com/2025/11/cisa-adds-actively-exploited-xss-bug.html",
    "snippet_raw": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has updated its Known Exploited Vulnerabilities (KEV) catalog to include a security flaw impacting OpenPLC ScadaBR, citing evidence of active exploitation. The vulnerability in question is CVE-2021-26829 (CVSS score: 5.4), a cross-site scripting (XSS) flaw that affects Windows and Linux versions of the software via",
    "source": "thehackernews.com",
    "time": "2025-11-30T09:23:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) has updated its Known Exploited Vulnerabilities (KEV) catalog to include a security flaw impacting OpenPLC ScadaBR, citing evidence of active exploitation. The vulnerability in question is CVE-20…"
  },
  {
    "title": "Japanese beer giant Asahi says data breach hit 1.5 million people",
    "url": "https://www.bleepingcomputer.com/news/security/japanese-beer-giant-asahi-says-data-breach-hit-15-million-people/",
    "snippet_raw": "Asahi Group Holdings, Japan's largest beer producer, has finished the investigation into the September cyberattack and found that the incident has impacted up to 1.9 million individuals. [...]",
    "source": "www.bleepingcomputer.com",
    "time": "2025-11-29T15:17:23+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Security"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Asahi Group Holdings, Japan's largest beer producer, has finished the investigation into the September cyberattack and found that the incident has impacted up to 1.9 million individuals. [...]"
  },
  {
    "title": "Man behind in-flight Evil Twin WiFi attacks gets 7 years in prison",
    "url": "https://www.bleepingcomputer.com/news/security/man-behind-in-flight-evil-twin-wifi-attacks-gets-7-years-in-prison/",
    "snippet_raw": "A 44-year-old man was sentenced to seven years and four months in prison for operating an \"evil twin\" WiFi network to steal the data of unsuspecting travelers at various airports across Australia. [...]",
    "source": "www.bleepingcomputer.com",
    "time": "2025-11-28T18:25:28+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Security",
      "Legal"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "A 44-year-old man was sentenced to seven years and four months in prison for operating an \"evil twin\" WiFi network to steal the data of unsuspecting travelers at various airports across Australia. [...]"
  },
  {
    "title": "North Korean Hackers Deploy 197 npm Packages to Spread Updated OtterCookie Malware",
    "url": "https://thehackernews.com/2025/11/north-korean-hackers-deploy-197-npm.html",
    "snippet_raw": "The North Korean threat actors behind the Contagious Interview campaign have continued to flood the npm registry with 197 more malicious packages since last month. According to Socket, these packages have been downloaded over 31,000 times, and are designed to deliver a variant of OtterCookie that brings together the features of BeaverTail and prior versions of OtterCookie. Some of the",
    "source": "thehackernews.com",
    "time": "2025-11-28T16:18:00+00:00",
    "region": "APJC",
    "severity": 2,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": "Resilience / Crisis Management",
    "type": "CRISIS",
    "snippet": "The North Korean threat actors behind the Contagious Interview campaign have continued to flood the npm registry with 197 more malicious packages since last month. According to Socket, these packages have been downloaded over 31,000 times, and are designed to …"
  },
  {
    "title": "French Soccer Federation Hit by Cyberattack, Member Data Stolen",
    "url": "https://www.securityweek.com/french-soccer-federation-hit-by-cyberattack-member-data-stolen/",
    "snippet_raw": "According to the federation, the unauthorized access was carried out using a compromised account. The post French Soccer Federation Hit by Cyberattack, Member Data Stolen appeared first on SecurityWeek .",
    "source": "www.securityweek.com",
    "time": "2025-11-28T14:39:14+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Data Breaches"
    ],
    "pillar": "Site Security / Insider Risk",
    "type": "PHYSICAL SECURITY",
    "snippet": "According to the federation, the unauthorized access was carried out using a compromised account. The post French Soccer Federation Hit by Cyberattack, Member Data Stolen appeared first on SecurityWeek ."
  },
  {
    "title": "MS Teams Guest Access Can Remove Defender Protection When Users Join External Tenants",
    "url": "https://thehackernews.com/2025/11/ms-teams-guest-access-can-remove.html",
    "snippet_raw": "Cybersecurity researchers have shed light on a cross-tenant blind spot that allows attackers to bypass Microsoft Defender for Office 365 protections via the guest access feature in Teams. \"When users operate as guests in another tenant, their protections are determined entirely by that hosting environment, not by their home organization,\" Ontinue security researcher Rhys Downing said in a report",
    "source": "thehackernews.com",
    "time": "2025-11-28T08:33:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Cybersecurity researchers have shed light on a cross-tenant blind spot that allows attackers to bypass Microsoft Defender for Office 365 protections via the guest access feature in Teams. \"When users operate as guests in another tenant, their protections are d…"
  },
  {
    "title": "Asahi Data Breach Impacts 2 Million Individuals",
    "url": "https://www.securityweek.com/asahi-data-breach-impacts-2-million-individuals/",
    "snippet_raw": "Hackers stole the personal information of customers and employees before deploying ransomware and crippling Asahi’s operations in Japan. The post Asahi Data Breach Impacts 2 Million Individuals appeared first on SecurityWeek .",
    "source": "www.securityweek.com",
    "time": "2025-11-27T15:52:10+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Data Breaches",
      "Ransomware",
      "Asahi",
      "data breach"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Hackers stole the personal information of customers and employees before deploying ransomware and crippling Asahi’s operations in Japan. The post Asahi Data Breach Impacts 2 Million Individuals appeared first on SecurityWeek ."
  },
  {
    "title": "Microsoft to Block Unauthorized Scripts in Entra ID Logins with 2026 CSP Update",
    "url": "https://thehackernews.com/2025/11/microsoft-to-block-unauthorized-scripts.html",
    "snippet_raw": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now. The update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"login.microsoftonline[.]com\" by only letting scripts from trusted Microsoft domains run. \"This update strengthens security and adds an extra",
    "source": "thehackernews.com",
    "time": "2025-11-27T15:37:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Microsoft has announced plans to improve the security of Entra ID authentication by blocking unauthorized script injection attacks starting a year from now. The update to its Content Security Policy (CSP) aims to enhance the Entra ID sign-in experience at \"log…"
  },
  {
    "title": "ThreatsDay Bulletin: AI Malware, Voice Bot Flaws, Crypto Laundering, IoT Attacks — and 20 More Stories",
    "url": "https://thehackernews.com/2025/11/threatsday-bulletin-ai-malware-voice.html",
    "snippet_raw": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there’s a lot happening in the cyber world. Criminals are getting creative — using smart tricks to steal data, sound real, and hide in plain sight. But they’re not the only ones moving fast. Governments and security teams are fighting back, shutting down fake",
    "source": "thehackernews.com",
    "time": "2025-11-27T10:03:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Hackers have been busy again this week. From fake voice calls and AI-powered malware to huge money-laundering busts and new scams, there’s a lot happening in the cyber world. Criminals are getting creative — using smart tricks to steal data, sound real, and hi…"
  },
  {
    "title": "Gainsight Expands Impacted Customer List Following Salesforce Security Alert",
    "url": "https://thehackernews.com/2025/11/gainsight-expands-impacted-customer.html",
    "snippet_raw": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought. The company said Salesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list\" as of November 21, 2025. It did not reveal the exact number of customers who were impacted, but its CEO, Chuck Ganapathi, said \"we",
    "source": "thehackernews.com",
    "time": "2025-11-27T07:03:00+00:00",
    "region": "Global",
    "severity": 2,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Gainsight has disclosed that the recent suspicious activity targeting its applications has affected more customers than previously thought. The company said Salesforce initially provided a list of 3 impacted customers and that it has \"expanded to a larger list…"
  },
  {
    "title": "New ShadowV2 botnet malware used AWS outage as a test opportunity",
    "url": "https://www.bleepingcomputer.com/news/security/new-shadowv2-botnet-malware-used-aws-outage-as-a-test-opportunity/",
    "snippet_raw": "A new Mirai-based botnet malware named 'ShadowV2' has been observed targeting IoT devices from D-Link, TP-Link, and other vendors with exploits for known vulnerabilities. [...]",
    "source": "www.bleepingcomputer.com",
    "time": "2025-11-26T22:24:14+00:00",
    "region": "Global",
    "severity": 2,
    "lat": null,
    "lon": null,
    "tags": [
      "Security"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "A new Mirai-based botnet malware named 'ShadowV2' has been observed targeting IoT devices from D-Link, TP-Link, and other vendors with exploits for known vulnerabilities. [...]"
  },
  {
    "title": "Shai-Hulud v2 Spreads From npm to Maven, as Campaign Exposes Thousands of Secrets",
    "url": "https://thehackernews.com/2025/11/shai-hulud-v2-campaign-spreads-from-npm.html",
    "snippet_raw": "The second wave of the Shai-Hulud supply chain attack has spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry. The Socket Research Team said it identified a Maven Central package named org.mvnpm:posthog-node:4.18.1 that embeds the same two components associated with Sha1-Hulud: the \"setup_bun.js\" loader and the main payload \"bun_environment.js.\" The",
    "source": "thehackernews.com",
    "time": "2025-11-26T18:08:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The second wave of the Shai-Hulud supply chain attack has spilled over to the Maven ecosystem after compromising more than 830 packages in the npm registry. The Socket Research Team said it identified a Maven Central package named org.mvnpm:posthog-node:4.18.1…"
  },
  {
    "title": "Qilin Ransomware Turns South Korean MSP Breach Into 28-Victim 'Korean Leaks' Data Heist",
    "url": "https://thehackernews.com/2025/11/qilin-ransomware-turns-south-korean-msp.html",
    "snippet_raw": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware. \"This operation combined the capabilities of a major Ransomware-as-a-Service (RaaS) group, Qilin, with potential involvement from North Korean state-affiliated actors (Moonstone Sleet), leveraging Managed Service Provider (MSP)",
    "source": "thehackernews.com",
    "time": "2025-11-26T14:31:00+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "South Korea's financial sector has been targeted by what has been described as a sophisticated supply chain attack that led to the deployment of Qilin ransomware. \"This operation combined the capabilities of a major Ransomware-as-a-Service (RaaS) group, Qilin,…"
  },
  {
    "title": "RomCom Uses SocGholish Fake Update Attacks to Deliver Mythic Agent Malware",
    "url": "https://thehackernews.com/2025/11/romcom-uses-socgholish-fake-update.html",
    "snippet_raw": "The threat actors behind a malware family known as RomCom targeted a U.S.-based civil engineering company via a JavaScript loader dubbed SocGholish to deliver the Mythic Agent. \"This is the first time that a RomCom payload has been observed being distributed by SocGholish,\" Arctic Wolf Labs researcher Jacob Faires said in a Tuesday report. The activity has been attributed with medium-to-high",
    "source": "thehackernews.com",
    "time": "2025-11-26T08:28:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The threat actors behind a malware family known as RomCom targeted a U.S.-based civil engineering company via a JavaScript loader dubbed SocGholish to deliver the Mythic Agent. \"This is the first time that a RomCom payload has been observed being distributed b…"
  },
  {
    "title": "Years of JSONFormatter and CodeBeautify Leaks Expose Thousands of Passwords and API Keys",
    "url": "https://thehackernews.com/2025/11/years-of-jsonformatter-and-codebeautify.html",
    "snippet_raw": "New research has found that organizations in various sensitive sectors, including governments, telecoms, and critical infrastructure, are pasting passwords and credentials into online tools like JSONformatter and CodeBeautify that are used to format and validate code. Cybersecurity company watchTowr Labs said it captured a dataset of over 80,000 files on these sites, uncovering thousands of",
    "source": "thehackernews.com",
    "time": "2025-11-25T16:49:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "New research has found that organizations in various sensitive sectors, including governments, telecoms, and critical infrastructure, are pasting passwords and credentials into online tools like JSONformatter and CodeBeautify that are used to format and valida…"
  },
  {
    "title": "ToddyCat’s New Hacking Tools Steal Outlook Emails and Microsoft 365 Access Tokens",
    "url": "https://thehackernews.com/2025/11/toddycats-new-hacking-tools-steal.html",
    "snippet_raw": "The threat actor known as ToddyCat has been observed adopting new methods to obtain access to corporate email data belonging to target companies, including using a custom tool dubbed TCSectorCopy. \"This attack allows them to obtain tokens for the OAuth 2.0 authorization protocol using the user's browser, which can be used outside the perimeter of the compromised infrastructure to access",
    "source": "thehackernews.com",
    "time": "2025-11-25T11:36:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The threat actor known as ToddyCat has been observed adopting new methods to obtain access to corporate email data belonging to target companies, including using a custom tool dubbed TCSectorCopy. \"This attack allows them to obtain tokens for the OAuth 2.0 aut…"
  },
  {
    "title": "CISA Warns of Active Spyware Campaigns Hijacking High-Value Signal and WhatsApp Users",
    "url": "https://thehackernews.com/2025/11/cisa-warns-of-active-spyware-campaigns.html",
    "snippet_raw": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday issued an alert warning of bad actors actively leveraging commercial spyware and remote access trojans (RATs) to target users of mobile messaging applications. \"These cyber actors use sophisticated targeting and social engineering techniques to deliver spyware and gain unauthorized access to a victim's messaging app,",
    "source": "thehackernews.com",
    "time": "2025-11-25T06:42:00+00:00",
    "region": "AMER",
    "severity": 2,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": "Site Security / Insider Risk",
    "type": "PHYSICAL SECURITY",
    "snippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Monday issued an alert warning of bad actors actively leveraging commercial spyware and remote access trojans (RATs) to target users of mobile messaging applications. \"These cyber actors use s…"
  },
  {
    "title": "New Fluent Bit Flaws Expose Cloud to RCE and Stealthy Infrastructure Intrusions",
    "url": "https://thehackernews.com/2025/11/new-fluent-bit-flaws-expose-cloud-to.html",
    "snippet_raw": "Cybersecurity researchers have discovered five vulnerabilities in Fluent Bit, an open-source and lightweight telemetry agent, that could be chained to compromise and take over cloud infrastructures. The security defects \"allow attackers to bypass authentication, perform path traversal, achieve remote code execution, cause denial-of-service conditions, and manipulate tags,\" Oligo Security said in",
    "source": "thehackernews.com",
    "time": "2025-11-24T15:03:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": "Site Security / Insider Risk",
    "type": "PHYSICAL SECURITY",
    "snippet": "Cybersecurity researchers have discovered five vulnerabilities in Fluent Bit, an open-source and lightweight telemetry agent, that could be chained to compromise and take over cloud infrastructures. The security defects \"allow attackers to bypass authenticatio…"
  },
  {
    "title": "⚡ Weekly Recap: Fortinet Exploit, Chrome 0-Day, BadIIS Malware, Record DDoS, SaaS Breach & More",
    "url": "https://thehackernews.com/2025/11/weekly-recap-fortinet-exploit-chrome-0.html",
    "snippet_raw": "This week saw a lot of new cyber trouble. Hackers hit Fortinet and Chrome with new 0-day bugs. They also broke into supply chains and SaaS tools. Many hid inside trusted apps, browser alerts, and software updates. Big firms like Microsoft, Salesforce, and Google had to react fast — stopping DDoS attacks, blocking bad links, and fixing live flaws. Reports also showed how fast fake news, AI",
    "source": "thehackernews.com",
    "time": "2025-11-24T12:32:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "This week saw a lot of new cyber trouble. Hackers hit Fortinet and Chrome with new 0-day bugs. They also broke into supply chains and SaaS tools. Many hid inside trusted apps, browser alerts, and software updates. Big firms like Microsoft, Salesforce, and Goog…"
  },
  {
    "title": "Chinese DeepSeek-R1 AI Generates Insecure Code When Prompts Mention Tibet or Uyghurs",
    "url": "https://thehackernews.com/2025/11/chinese-ai-model-deepseek-r1-generates.html",
    "snippet_raw": "New research from CrowdStrike has revealed that DeepSeek's artificial intelligence (AI) reasoning model DeepSeek-R1 produces more security vulnerabilities in response to prompts that contain topics deemed politically sensitive by China. \"We found that when DeepSeek-R1 receives prompts containing topics the Chinese Communist Party (CCP) likely considers politically sensitive, the likelihood of it",
    "source": "thehackernews.com",
    "time": "2025-11-24T11:07:00+00:00",
    "region": "APJC",
    "severity": 2,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "New research from CrowdStrike has revealed that DeepSeek's artificial intelligence (AI) reasoning model DeepSeek-R1 produces more security vulnerabilities in response to prompts that contain topics deemed politically sensitive by China. \"We found that when Dee…"
  },
  {
    "title": "ShadowPad Malware Actively Exploits WSUS Vulnerability for Full System Access",
    "url": "https://thehackernews.com/2025/11/shadowpad-malware-actively-exploits.html",
    "snippet_raw": "A recently patched security flaw in Microsoft Windows Server Update Services (WSUS) has been exploited by threat actors to distribute a malware known as ShadowPad. \"The attacker targeted Windows Servers with WSUS enabled, exploiting CVE-2025-59287 for initial access,\" AhnLab Security Intelligence Center (ASEC) said in a report published last week. \"They then used PowerCat, an open-source",
    "source": "thehackernews.com",
    "time": "2025-11-24T07:18:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "A recently patched security flaw in Microsoft Windows Server Update Services (WSUS) has been exploited by threat actors to distribute a malware known as ShadowPad. \"The attacker targeted Windows Servers with WSUS enabled, exploiting CVE-2025-59287 for initial …"
  },
  {
    "title": "China-Linked APT31 Launches Stealthy Cyberattacks on Russian IT Using Cloud Services",
    "url": "https://thehackernews.com/2025/11/china-linked-apt31-launches-stealthy.html",
    "snippet_raw": "The China-linked advanced persistent threat (APT) group known as APT31 has been attributed to cyber attacks targeting the Russian information technology (IT) sector between 2024 and 2025 while staying undetected for extended periods of time. \"In the period from 2024 to 2025, the Russian IT sector, especially companies working as contractors and integrators of solutions for government agencies,",
    "source": "thehackernews.com",
    "time": "2025-11-22T15:19:00+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The China-linked advanced persistent threat (APT) group known as APT31 has been attributed to cyber attacks targeting the Russian information technology (IT) sector between 2024 and 2025 while staying undetected for extended periods of time. \"In the period fro…"
  },
  {
    "title": "CISA Warns of Actively Exploited Critical Oracle Identity Manager Zero-Day Vulnerability",
    "url": "https://thehackernews.com/2025/11/cisa-warns-of-actively-exploited.html",
    "snippet_raw": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw impacting Oracle Identity Manager to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. The vulnerability in question is CVE-2025-61757 (CVSS score: 9.8), a case of missing authentication for a critical function that can result in pre-authenticated",
    "source": "thehackernews.com",
    "time": "2025-11-22T06:45:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The U.S. Cybersecurity and Infrastructure Security Agency (CISA) on Friday added a critical security flaw impacting Oracle Identity Manager to its Known Exploited Vulnerabilities (KEV) catalog, citing evidence of active exploitation. The vulnerability in quest…"
  },
  {
    "title": "SEC Drops SolarWinds Case After Years of High-Stakes Cybersecurity Scrutiny",
    "url": "https://thehackernews.com/2025/11/sec-drops-solarwinds-case-after-years.html",
    "snippet_raw": "The U.S. Securities and Exchange Commission (SEC) has abandoned its lawsuit against SolarWinds and its chief information security officer, alleging that the company had misled investors about the security practices that led to the 2020 supply chain attack. In a joint motion filed November 20, 2025, the SEC, along with SolarWinds and its CISO Timothy G. Brown, asked the court to voluntarily",
    "source": "thehackernews.com",
    "time": "2025-11-21T08:05:00+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "The U.S. Securities and Exchange Commission (SEC) has abandoned its lawsuit against SolarWinds and its chief information security officer, alleging that the company had misled investors about the security practices that led to the 2020 supply chain attack. In …"
  },
  {
    "title": "Salesforce Flags Unauthorized Data Access via Gainsight-Linked OAuth Activity",
    "url": "https://thehackernews.com/2025/11/salesforce-flags-unauthorized-data.html",
    "snippet_raw": "Salesforce has warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform. \"Our investigation indicates this activity may have enabled unauthorized access to certain customers’ Salesforce data through the app's connection,\" the company said in an advisory. The cloud services firm said it has taken the step of revoking all active access and refresh",
    "source": "thehackernews.com",
    "time": "2025-11-21T05:32:00+00:00",
    "region": "Global",
    "severity": 1,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": "Site Security / Insider Risk",
    "type": "PHYSICAL SECURITY",
    "snippet": "Salesforce has warned of detected \"unusual activity\" related to Gainsight-published applications connected to the platform. \"Our investigation indicates this activity may have enabled unauthorized access to certain customers’ Salesforce data through the app's …"
  },
  {
    "title": "ShadowRay 2.0 Exploits Unpatched Ray Flaw to Build Self-Spreading GPU Cryptomining Botnet",
    "url": "https://thehackernews.com/2025/11/shadowray-20-exploits-unpatched-ray.html",
    "snippet_raw": "Oligo Security has warned of ongoing attacks exploiting a two-year-old security flaw in the Ray open-source artificial intelligence (AI) framework to turn infected clusters with NVIDIA GPUs into a self-replicating cryptocurrency mining botnet. The activity, codenamed ShadowRay 2.0, is an evolution of a prior wave that was observed between September 2023 and March 2024. The attack, at its core,",
    "source": "thehackernews.com",
    "time": "2025-11-20T17:24:00+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Oligo Security has warned of ongoing attacks exploiting a two-year-old security flaw in the Ray open-source artificial intelligence (AI) framework to turn infected clusters with NVIDIA GPUs into a self-replicating cryptocurrency mining botnet. The activity, co…"
  },
  {
    "title": "ThreatsDay Bulletin: 0-Days, LinkedIn Spies, Crypto Crimes, IoT Flaws and New Malware Waves",
    "url": "https://thehackernews.com/2025/11/threatsday-bulletin-0-days-linkedin.html",
    "snippet_raw": "This week has been crazy in the world of hacking and online security. From Thailand to London to the US, we've seen arrests, spies at work, and big power moves online. Hackers are getting caught. Spies are getting better at their jobs. Even simple things like browser add-ons and smart home gadgets are being used to attack people. Every day, there's a new story that shows how quickly things are",
    "source": "thehackernews.com",
    "time": "2025-11-20T12:29:00+00:00",
    "region": "APJC",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "This week has been crazy in the world of hacking and online security. From Thailand to London to the US, we've seen arrests, spies at work, and big power moves online. Hackers are getting caught. Spies are getting better at their jobs. Even simple things like …"
  },
  {
    "title": "Microsoft Patch Tuesday, November 2025 Edition",
    "url": "https://krebsonsecurity.com/2025/11/microsoft-patch-tuesday-november-2025-edition/",
    "snippet_raw": "Microsoft this week pushed security updates to fix more than 60 vulnerabilities in its Windows operating systems and supported software, including at least one zero-day bug that is already being exploited. Microsoft also fixed a glitch that prevented some Windows 10 users from taking advantage of an extra year of security updates, which is nice because the zero-day flaw and other critical weaknesses patched today affect all versions of Windows, including Windows 10.",
    "source": "krebsonsecurity.com",
    "time": "2025-11-16T21:47:14+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "Time to Patch",
      "Action1",
      "Alex Vovk",
      "Azure Monitor Agent",
      "Chris Goettl",
      "CVE-2025-60274",
      "CVE-2025-62199",
      "CVE-2025-62215",
      "GitHub Copilot",
      "Ivanti",
      "Johannes Ullrich",
      "KB5071959",
      "Microsoft Patch Tuesday November 2025",
      "Nick Carroll",
      "Nightwing",
      "Office",
      "SANS Technology Institute",
      "Sharepoint",
      "SQL Server",
      "Visual Studio"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Microsoft this week pushed security updates to fix more than 60 vulnerabilities in its Windows operating systems and supported software, including at least one zero-day bug that is already being exploited. Microsoft also fixed a glitch that prevented some Wind…"
  },
  {
    "title": "Cloudflare Scrubs Aisuru Botnet from Top Domains List",
    "url": "https://krebsonsecurity.com/2025/11/cloudflare-scrubs-aisuru-botnet-from-top-domains-list/",
    "snippet_raw": "For the past week, domains associated with the massive Aisuru botnet have repeatedly usurped Amazon, Apple, Google and Microsoft in Cloudflare's public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names from their top websites list. The chief executive at Cloudflare says Aisuru's overlords are using the botnet to boost their malicious domain rankings, while simultaneously attacking the company's domain name system (DNS) service.",
    "source": "krebsonsecurity.com",
    "time": "2025-11-06T02:04:36+00:00",
    "region": "Global",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "A Little Sunshine",
      "DDoS-for-Hire",
      "Internet of Things (IoT)",
      "Web Fraud 2.0",
      "Aisuru",
      "Alex Greenland",
      "Amazon",
      "CloudFlare",
      "Cloudflare Radar",
      "Epi",
      "Google Apple",
      "Infoblox",
      "Matthew Prince",
      "microsoft",
      "Renee Burton"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "For the past week, domains associated with the massive Aisuru botnet have repeatedly usurped Amazon, Apple, Google and Microsoft in Cloudflare's public ranking of the most frequently requested websites. Cloudflare responded by redacting Aisuru domain names fro…"
  },
  {
    "title": "Aisuru Botnet Shifts from DDoS to Residential Proxies",
    "url": "https://krebsonsecurity.com/2025/10/aisuru-botnet-shifts-from-ddos-to-residential-proxies/",
    "snippet_raw": "Aisuru, the botnet responsible for a series of record-smashing distributed denial-of-service (DDoS) attacks this year, recently was overhauled to support a more low-key, lucrative and sustainable business: Renting hundreds of thousands of infected Internet of Things (IoT) devices to proxy services that help cybercriminals anonymize their traffic. Experts says a glut of proxies from Aisuru and other sources is fueling large-scale data harvesting efforts tied to various artificial intelligence (AI) projects, helping content scrapers evade detection by routing their traffic through residential connections that appear to be regular Internet users.",
    "source": "krebsonsecurity.com",
    "time": "2025-10-29T00:51:05+00:00",
    "region": "AMER",
    "severity": 3,
    "lat": null,
    "lon": null,
    "tags": [
      "A Little Sunshine",
      "DDoS-for-Hire",
      "Internet of Things (IoT)",
      "The Coming Storm",
      "Web Fraud 2.0",
      "360Proxy",
      "911Proxy",
      "922Proxy",
      "ABCProxy",
      "Aisuru botnet",
      "Benjamin Brundage",
      "Bright Data",
      "Cherry Proxy",
      "Denas Grybauskas",
      "google",
      "HK Network",
      "internet of things",
      "IP2World",
      "LibreNews",
      "LunaProxy",
      "NETSCOUT",
      "Oxylabs",
      "Philippe Caturegli",
      "PIA S5 Proxy",
      "PyProxy",
      "Reddit",
      "residential proxy",
      "Riley Kilmer",
      "roland dobbins",
      "Roxlabs",
      "Seralys",
      "spur.us",
      "Synthient"
    ],
    "pillar": null,
    "type": "GENERAL",
    "snippet": "Aisuru, the botnet responsible for a series of record-smashing distributed denial-of-service (DDoS) attacks this year, recently was overhauled to support a more low-key, lucrative and sustainable business: Renting hundreds of thousands of infected Internet of …"
  }
]