[
  {
    "title": "YouTube says it will comply with Australia's teen social media ban",
    "url": "https://www.straitstimes.com/asia/youtube-says-it-will-comply-with-australias-teen-social-media-ban",
    "snippet": "SYDNEY, Dec 3 - Google's YouTube shared a \\\"disappointing update\\\" to millions of Australian users and content creators on Wednesday, saying it will comply with a world-first teen social media ban by locking out users aged under 16 from their accounts within days.",
    "source": "straitstimes.com",
    "time": "2025-12-03T02:55:24",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "South Korea's Lee says on martial law anniversary perpetrators must face justice",
    "url": "https://www.straitstimes.com/asia/south-koreas-lee-says-on-martial-law-anniversary-perpetrators-must-face-justice",
    "snippet": "SEOUL, Dec 3 - South Korean President Lee Jae Myung said on Wednesday there was still work to be done to address the fallout of the failed martial law bid by his predecessor a year ago, and the country needed to ensure the perpetrators were brought to justice.",
    "source": "straitstimes.com",
    "time": "2025-12-03T02:55:14",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Whereabouts of 6-year-old Chinese boy Yuanxin unknown after ICE detention",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3334988/where-yuanxin-whereabouts-6-year-old-chinese-boy-unknown-after-ice-detention?utm_source=rss_feed",
    "snippet": "The whereabouts of a six-year-old boy from China remain unknown after he was allegedly separated from his father while both were held by US Immigration and Customs Enforcement (ICE) in New York last week.\nThe city’s mayor-elect Zohran Mamdani on Tuesday raised the issue on social media, saying that the first grader, named Yuanxin, was “arrested and separated” along with his father Fei Zheng during a “routine check-in” with ICE on November 26.\n“Now he’s in custody, alone. ICE won’t say where....",
    "source": "scmp.com",
    "time": "2025-12-03T02:51:08",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Big Brother or fraud guard? India rushes to reassure users about ‘snooping’ app",
    "url": "https://www.scmp.com/news/asia/south-asia/article/3334987/india-reassures-users-about-snooping-state-run-app-you-can-delete-it?utm_source=rss_feed",
    "snippet": "India sought to address concerns that its mandate to pre-install a cybersecurity app on mobile phones could invade privacy or enable surveillance, saying individuals can remove the software from devices.\nIn a directive on Friday, the Ministry of Communications asked phone makers and importers to pre-install the Sanchar Saathi app, which is aimed at curbing cyber fraud. The order instructed firms to ensure the app is readily accessible and “that its functionalities are not disabled or...",
    "source": "scmp.com",
    "time": "2025-12-03T02:48:34",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Centrist Nasralla takes slim lead in Honduran presidential election plagued by delays as Trump alleges fraud",
    "url": "https://www.straitstimes.com/asia/centrist-nasralla-takes-slim-lead-in-honduran-presidential-election-plagued-by-delays-as-trump-alleges-fraud",
    "snippet": "TEGUCIGALPA, Dec 2 - Salvador Nasralla, of the centrist Liberal Party, on Tuesday took a razor-thin lead in Honduras' presidential election over Nasry Asfura, the conservative candidate backed by U.S. President Donald Trump,  in a vote count plagued by delays and allegations of fraud.",
    "source": "straitstimes.com",
    "time": "2025-12-03T02:20:19",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "US pauses all immigration applications from 19 countries",
    "url": "https://www.scmp.com/news/world/united-states-canada/article/3334983/us-pauses-all-immigration-applications-19-countries?utm_source=rss_feed",
    "snippet": "The Trump administration on Tuesday said it paused all immigration applications, including green card and US citizenship processing, filed by immigrants from 19 non-European countries, citing concerns over national security and public safety.\nThe pause applies to people from 19 countries that were already subjected to a partial travel ban in June, placing further restrictions on immigration – a core feature of US President Donald Trump’s political platform.\nThe list of countries includes...",
    "source": "scmp.com",
    "time": "2025-12-03T02:16:14",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Pete Hegseth says he ‘didn’t stick around’ to watch second strike on alleged drug boat as Democrats slam administration over attacks – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/02/donald-trump-pete-hegseth-boat-venezuela-maduro-tennessee-us-politics-live-news-updates",
    "snippet": "Defense secretary says he ‘moved on to my next meeting’ as sensitive military operation was under way; top Democrat calls Hegseth ‘spineless’ and ‘a national embarrassment’ White House ‘selling out’ admiral to shield Hegseth over strikes, officials say Trump threatens strikes on any country he claims makes drugs for US Joseph Gedeon is a politics breaking news reporter based in Washington The FBI director, Kash Patel , is “in over his head” and leading a “chronically under-performing” agency paralyzed by fear and plummeting morale, according to a scathing 115-page report compiled by a national alliance of retired and active-duty FBI special agents and analysts. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-03T02:09:09",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Taiwan looking forward to re-establish ties with Honduras, foreign minister says",
    "url": "https://www.straitstimes.com/asia/taiwan-looking-forward-to-re-establish-ties-with-honduras-foreign-minister-says",
    "snippet": "TAIPEI, Dec 3 - Taiwan is looking forward to re-establishing ties with former ally Honduras and has been in touch with both of the presidential candidates who are friendly towards Taipei, Foreign Minister Lin Chia-lung said on Wednesday.",
    "source": "straitstimes.com",
    "time": "2025-12-03T02:05:10",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "In greying Japan, killings of parents by elderly children spur soul-searching",
    "url": "https://www.scmp.com/week-asia/lifestyle-culture/article/3334930/greying-japan-killings-parents-elderly-children-spur-soul-searching?utm_source=rss_feed",
    "snippet": "Masato Watabe made no effort to hide the killing. A little over an hour after he held his hand over his victim’s mouth until she was no longer breathing, he called the emergency services. Taken into custody, 79-year-old Watabe admitted to police that he alone was to blame for her death.\nInstead of blanket condemnation, however, Watabe has attracted sympathy in Japan, which is struggling to come up with solutions to a rapidly ageing population and growing pressure on families to take care of the...",
    "source": "scmp.com",
    "time": "2025-12-03T02:00:15",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Drones on the rise over South China Sea with shift to data-driven strategies",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3334927/drones-are-rise-over-south-china-sea-shift-data-driven-strategies?utm_source=rss_feed",
    "snippet": "Across the strategic waterway of the South China Sea, claimant countries are increasingly relying on long-endurance aerial drones to carry out continuous patrols – overcoming the geographic and logistical limitations of traditional aircraft and ships.\nThe US Marine Corps last month deployed MQ-9A Reaper drones to the Philippines, at Manila’s request, to “support Philippine regional maritime security through shared maritime domain awareness”, according the US Marine Corps Forces, Pacific.\nThe...",
    "source": "scmp.com",
    "time": "2025-12-03T02:00:10",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Kremlin signals no breakthrough after Ukraine talks with US",
    "url": "https://www.bbc.com/news/articles/cwyv0ex7v8ro?at_medium=RSS&at_campaign=rss",
    "snippet": "Five hours of talks between Putin and US negotiators were “constructive”, Kremlin officials say, but “a lot of work lies ahead”.",
    "source": "bbc.com",
    "time": "2025-12-03T01:57:20",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Hong Kong will miss its most popular philosopher",
    "url": "https://www.scmp.com/opinion/hong-kong-opinion/article/3334747/hong-kong-will-miss-its-most-popular-philosopher?utm_source=rss_feed",
    "snippet": "Once, when pop diva Faye Wong was seen reading on a plane, the book reportedly on her lap was the perennial local bestseller Art of Thinking by Lee Tien-ming.\nFood critic, columnist and media personality Benny Li Shun-Yan reportedly said that after learning of her interest, he introduced Wong to Lee, arguably Hong Kong’s most famous philosopher, who passed away last week at the age of 80.\nI remember that some were surprised by Wong’s philosophical interests. Actually, mainland entertainers often...",
    "source": "scmp.com",
    "time": "2025-12-03T01:30:09",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Trump and Lula hold phone call to discuss US tariffs on Brazil, sanctions",
    "url": "https://www.aljazeera.com/news/2025/12/3/trump-and-lula-hold-phone-call-to-discuss-us-tariffs-on-brazil-sanctions?traffic_source=rss",
    "snippet": "US president has warmed to Brazil's left-wing leader since imposing 50 percent tariffs on the South American country.",
    "source": "aljazeera.com",
    "time": "2025-12-03T01:20:09",
    "region": "LATAM",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Russia-Ukraine war: List of key events, day 1,378",
    "url": "https://www.aljazeera.com/news/2025/12/3/russia-ukraine-war-list-of-key-events-day-1378?traffic_source=rss",
    "snippet": "These are the key developments from day 1,378 of Russia’s war on Ukraine.",
    "source": "aljazeera.com",
    "time": "2025-12-03T01:18:36",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Fight’s over: YouTube becomes last major platform to accept Australia’s age rule",
    "url": "https://www.scmp.com/news/asia/australasia/article/3334977/youtube-capitulates-australias-age-rule-becomes-last-major-platform-accept?utm_source=rss_feed",
    "snippet": "Google’s YouTube said it would obey Australia’s world-leading ban on social media accounts for children under 16, a capitulation which means all the most popular platforms with young users have agreed to comply after campaigning against the law.\nGoogle initially received an exemption on grounds its main purpose was video viewing and education, not social networking. Canberra later broadened the scope of the ban to include it following complaints by other platforms.\n“We will comply with the law...",
    "source": "scmp.com",
    "time": "2025-12-03T01:15:47",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Residents of block return to fire-hit Hong Kong estate to collect belongings",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3334969/residents-block-return-fire-ravaged-hong-kong-estate-collect-personal-items?utm_source=rss_feed",
    "snippet": "This story has been made freely available as a public service to our readers. Please consider supporting SCMP’s journalism by subscribing. Get faster notifications on the latest updates by downloading our app.\nWhat we know so far:\n\n156 people, including a firefighter, confirmed dead\n\n\n79 injured, including 12 firefighters\n\n\nAbout 30 people remain unaccounted for\n\n\nHK$2.3 billion raised for rescue and relief efforts\n\n\nThe eight blocks in Wang Fuk Court had been undergoing renovations since July...",
    "source": "scmp.com",
    "time": "2025-12-03T01:04:01",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "A New Chapter in Bilingual Excellence: YK Pao School Hong Kong Appoints its Founding Head",
    "url": "https://www.scmp.com/presented/news/hong-kong/education/topics/yk-pao-school-hk-appoints-founding-head/article/3334763/new-chapter-bilingual-excellence-yk-pao-school-hong-kong-appoints-its-founding-head?utm_source=rss_feed",
    "snippet": "[The content of this article has been produced by our advertising partner.]\nHONG KONG – 3 December 2025 – In a significant milestone in its founding, YK Pao School Hong Kong today announces the appointment of Mrs. Cathy Braithwaite as its Founding Head. This appointment marks the next step in realising a visionary educational project that will weave together the rich tapestry of Chinese heritage with a forward-thinking global perspective.\nScheduled to open its doors in September 2026, this...",
    "source": "scmp.com",
    "time": "2025-12-03T01:01:21",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Chinese man hides 2 gold bars in chilli sauce jar, sends to ‘friend’ for investment",
    "url": "https://www.scmp.com/news/people-culture/trending-china/article/3334362/chinese-man-hides-2-gold-bars-jar-chilli-sauce-sending-friend-investment?utm_source=rss_feed",
    "snippet": "A Chinese man has caused amusement online after he hid two gold bars inside a jar of chilli sauce and mailed them to another province as part of a scam to fund his stock trading account.\nThe incident recently unfolded in the Jinnan District of Tianjin in northern China when police took down a fraud scheme involving an elderly man.\nLi Ruifang, a police officer from the Shuanglin Police Station, received an anti-fraud alert indicating that an elderly man, surnamed Zhao, might be in contact with...",
    "source": "scmp.com",
    "time": "2025-12-03T01:00:10",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "US Justice Department seeks to dismiss lawsuit over Maurene Comey’s firing",
    "url": "https://www.aljazeera.com/news/2025/12/3/us-justice-department-seeks-to-dismiss-lawsuit-over-maurene-comeys-firing?traffic_source=rss",
    "snippet": "Comey alleges that the Trump administration fired her for political reasons, including her family ties to James Comey.",
    "source": "aljazeera.com",
    "time": "2025-12-03T00:54:34",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "South Korea’s Lee says martial law clean-up not yet complete on first anniversary",
    "url": "https://www.straitstimes.com/asia/east-asia/south-koreas-lee-says-martial-law-clean-up-not-yet-complete-on-first-anniversary",
    "snippet": "The people rose up and stopped the military with their bare hands, Mr Lee said during the anniversary.",
    "source": "straitstimes.com",
    "time": "2025-12-03T00:50:21",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Donald's sleepy Joe moment? Newsom shares video of Trump ‘sleeping’ in cabinet meeting - watch",
    "url": "https://timesofindia.indiatimes.com/world/us/donalds-sleepy-joe-moment-gavin-newsom-shares-video-of-trump-sleeping-in-his-cabinet-meeting-watch/articleshow/125730929.cms",
    "snippet": "California Governor Gavin Newsom shared a video of President Trump appearing to nod off during a cabinet meeting, with eyes narrowed and shut while officials briefed him. The White House denied the claims, stating Trump listened attentively throughout the three-hour meeting. This incident follows past reports and Trump's own criticisms of Joe Biden's stamina.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-03T00:31:37",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Beijing woos foreign firms as China seeks bigger role in global shipbuilding supply chain",
    "url": "https://www.scmp.com/business/china-business/article/3334950/beijing-woos-foreign-firms-china-seeks-bigger-role-global-shipbuilding-supply-chain?utm_source=rss_feed",
    "snippet": "Beijing is extending an olive branch to overseas companies as it seeks to build a more integrated global supply chain for the shipbuilding industry, in its latest push to project goodwill and support free trade.\nGao Dongsheng, chief economist at the Ministry of Industry and Information Technology (MIIT), said on Tuesday that China was committed to further opening up its shipbuilding sector.\nMainland shipyards, which currently have a capacity to build about 65 million deadweight tonnes of large...",
    "source": "scmp.com",
    "time": "2025-12-03T00:30:09",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Hong Kong man, 87, with dementia found dead 9 days after going missing",
    "url": "https://www.scmp.com/news/hong-kong/society/article/3334975/hong-kong-man-87-dementia-found-dead-nine-days-after-going-missing?utm_source=rss_feed",
    "snippet": "An elderly Hong Kong man with dementia who had been missing for nine days was found dead in the countryside by volunteer search teams.\nLeung Woon-yew, 87, a resident of Tai Hing Estate in Tuen Mun, was discovered in a bushy area near the top of Por Lo Shan at 12.40pm on Tuesday by the Voluntary Mount Search Team and Countryside Volunteer Search Team, according to Anson Cheng, founder of the Hong Kong Guardians volunteer rescue group.\nThe groups had joined the search with authorities from the...",
    "source": "scmp.com",
    "time": "2025-12-03T00:21:28",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Australia’s anti-migration populist Pauline Hanson eyes political resurgence",
    "url": "https://www.straitstimes.com/asia/australias-anti-migration-populist-pauline-hanson-eyes-political-resurgence",
    "snippet": "SYDNEY, Dec 3 - Australia's flame-haired populist Senator Pauline Hanson and her anti-immigration party have rocketed up opinion polls, nearing a peak seen three decades ago when she first entered politics and pushed conservative parties to harden border policies.",
    "source": "straitstimes.com",
    "time": "2025-12-03T00:20:11",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Polarised South Korea marks martial law anniversary",
    "url": "https://www.straitstimes.com/asia/east-asia/polarised-south-korea-marks-martial-law-anniversary",
    "snippet": "On Dec 3, 2024, Yoon suspended civilian rule for the first time in more than four decades.",
    "source": "straitstimes.com",
    "time": "2025-12-03T00:10:00",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Ilhan Omar denounces Donald Trump for calling Somali immigrants ‘garbage’",
    "url": "https://www.aljazeera.com/news/2025/12/3/ilhan-omar-denounces-donald-trump-for-calling-somali-immigrants-garbage?traffic_source=rss",
    "snippet": "Congresswoman Omar calls Trump's comments about her 'creepy' after the US president launches into an anti-Somali tirade.",
    "source": "aljazeera.com",
    "time": "2025-12-03T00:08:20",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Handling of China spying case was ‘shambolic’, security committee concludes",
    "url": "https://www.theguardian.com/world/2025/dec/03/uk-china-spying-case-collapse-security-committee-report",
    "snippet": "Report says ‘systemic failures’ led to collapse of trial, but found no evidence of UK government interference Parliament’s security committee has criticised prosecutors for pulling their charges against two men accused of spying for Beijing, in a damning report that concluded the handling of the case was “shambolic”. MPs said that a process “beset by confusion and misaligned expectations” and “inadequate” communication between the government and Crown Prosecution Service (CPS) had contributed to the collapse of the trial, while several “opportunities to correct course were missed”. It was “unclear” why the CPS had concluded that a July 2024 ruling concerning a Bulgarian spy ring “altered the legal landscape so significantly” that they had to change their approach. It was “surprised” the CPS had deemed the government’s evidence insufficient to put to a jury when it had set out how China “posed a range of threats to the United Kingdom’s national security” that “amounted to a more general active threat”. The government “did not have sufficiently clear processes for escalating issues where there was a lack of clarity” and “the level of senior oversight” from cabinet ministers and national security advisers “was insufficiently robust”. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-03T00:01:47",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "South Korea proposes special court to address ‘mockery of judicial process’",
    "url": "https://www.scmp.com/week-asia/people/article/3334859/south-korea-proposes-separate-court-tackle-martial-law-decree-cases-after-cries-bias?utm_source=rss_feed",
    "snippet": "A year after former president Yoon Suk-yeol declared martial law, South Korea’s ruling Democratic Party of Korea (DPK) is pushing ahead with a bill to create a separate court dedicated to handling cases linked to the decree, in response to widespread public distrust of what critics describe as a “biased” judiciary.\nPresident Lee Jae-myung warned on social media ahead of the December 3 anniversary of the decree: “If we leave hidden acts of insurrection as they are, insurrection will certainly...",
    "source": "scmp.com",
    "time": "2025-12-03T00:00:14",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Stonehenge just got stranger: Archaeologists confirm massive man-made ring of pits underground",
    "url": "https://timesofindia.indiatimes.com/etimes/trending/stonehenge-just-got-stranger-archaeologists-confirm-massive-man-made-ring-of-pits-underground/articleshow/125725186.cms",
    "snippet": "New research has confirmed that a vast ring of Neolithic pits, more than a mile wide and over 4,000 years old, was deliberately engineered near Stonehenge, not formed by nature. Using cutting-edge dating and soil-analysis techniques, researchers argue it reflects an ancient belief system inscribed into the land itself. The discovery suggests Stonehenge’s builders shaped not only monuments of stone, but also monuments of earth.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T23:36:10",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "YouTube says kids will be ‘less safe’ under Australia’s social media ban",
    "url": "https://www.straitstimes.com/asia/australianz/youtube-says-kids-to-be-less-safe-under-australias-social-media-ban",
    "snippet": "YouTube was originally slated to escape the ban so children could watch educational videos.",
    "source": "straitstimes.com",
    "time": "2025-12-02T23:35:00",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Trump seizes on China ‘ban’ in Brazil soy trade, but data shows US gains small",
    "url": "https://www.scmp.com/news/china/diplomacy/article/3334973/trump-seizes-china-ban-brazil-select-soy-trade-data-shows-us-gains-small?utm_source=rss_feed",
    "snippet": "US President Donald Trump and his administration on Tuesday seized on China’s recent ban on select Brazilian soybean shipments, touting it as proof they had won Beijing back over to US suppliers even though official data shows China has only resumed American purchases modestly.\nAt a lengthy, end-of-year cabinet meeting, US Agriculture Secretary Brooke Rollins said that “just a couple of days ago, China announced that they were going to halt all purchases from Brazil because they had found some...",
    "source": "scmp.com",
    "time": "2025-12-02T23:30:51",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "The photo that became a symbol for Hong Kong’s deadly fire",
    "url": "https://www.straitstimes.com/asia/east-asia/the-photo-that-became-a-symbol-for-hong-kongs-deadly-fire",
    "snippet": "A week after the tragedy, Mr Wong's wife is still unaccounted for and is among the 30 people listed missing.",
    "source": "straitstimes.com",
    "time": "2025-12-02T23:30:17",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "From chips to noodles: the newcomers testing Hong Kong’s buoyant IPO market",
    "url": "https://www.scmp.com/business/banking-finance/article/3334910/chips-noodles-newcomers-testing-hong-kongs-buoyant-ipo-market?utm_source=rss_feed",
    "snippet": "Hong Kong’s booming fundraising market is set for another busy week, with four companies scheduled to debut this week and a string of billion-dollar listings – including Chinese luxury electric vehicle maker Avatr Technology – lining up behind them.\nAmong this week’s newcomers, chip materials supplier Guangdong Tianyu Semiconductor plans to raise the highest sum, seeking up to HK$1.74 billion (US$223.42 million) from the sale of 30.07 million shares.\nThe shares have been priced at HK$58 each....",
    "source": "scmp.com",
    "time": "2025-12-02T23:30:09",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "‘No compromise’ on territory after Ukraine talks with US: Russian official",
    "url": "https://www.aljazeera.com/news/2025/12/2/no-compromise-territory-ukraine-talks-us-kremlin?traffic_source=rss",
    "snippet": "Comments come after long meeting between Russian President Vladimir Putin and two senior US officials in Moscow.",
    "source": "aljazeera.com",
    "time": "2025-12-02T23:23:56",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Family voices new alarm for Hong Kong’s jailed Jimmy Lai",
    "url": "https://www.straitstimes.com/asia/east-asia/family-voices-new-alarm-for-hong-kongs-jailed-jimmy-lai",
    "snippet": "He faces at least 15 years in prison – effectively a death sentence – on charges of foreign collusion.",
    "source": "straitstimes.com",
    "time": "2025-12-02T23:20:00",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "India, Pakistan trade barbs over aid to cyclone-hit Sri Lanka",
    "url": "https://www.straitstimes.com/asia/south-asia/india-pakistan-trade-barbs-over-aid-to-cyclone-hit-sri-lanka",
    "snippet": "India and Pakistan have both extended an airspace ban on the other country’s airlines earlier in 2025.",
    "source": "straitstimes.com",
    "time": "2025-12-02T22:40:00",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Barcelona extend lead at top of La Liga with 3-1 win over Atletico Madrid",
    "url": "https://www.aljazeera.com/sports/2025/12/2/barcelona-extend-lead-at-top-of-la-liga-with-3-1-win-over-atletico-madrid?traffic_source=rss",
    "snippet": "Barca recover from a goal down to win, with strikes from Raphinha, Dani Olmo and Ferran Torres.",
    "source": "aljazeera.com",
    "time": "2025-12-02T22:33:45",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "South Korea court dismisses request to detain former finance minister in martial law probe",
    "url": "https://www.straitstimes.com/asia/east-asia/south-korea-court-dismisses-request-to-detain-former-finance-minister-in-martial-law-probe-yonhap",
    "snippet": "The probe of Yoon's martial law declaration has led to the arrest of several former government and military officials.",
    "source": "straitstimes.com",
    "time": "2025-12-02T22:15:08",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Candace Owens alleges TPUSA leaders betrayed Charlie Kirk before deadly shooting and vows to show evidence",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/i-will-be-naming-candace-owens-alleges-tpusa-leaders-betrayed-charlie-kirk-before-deadly-shooting-and-vows-to-show-evidence/articleshow/125728624.cms",
    "snippet": "Candace Owens claims Charlie Kirk was betrayed by people within Turning Point USA and plans to release proof. She urged donors to seek refunds, stating leadership was aware. This assertion has caused tension, with Christian influencer Allie Beth Stuckey pushing back against Owens' claims and emphasizing the need for truth and careful speech.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T22:13:23",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Korea arrests suspects selling intimate videos from hacked IP cameras",
    "url": "https://www.bleepingcomputer.com/news/security/korea-arrests-suspects-selling-intimate-videos-from-hacked-ip-cameras/",
    "snippet": "The Korean National Police have arrested four individuals suspected of hacking over 120,000 IP cameras across the country and then selling stolen footage to a foreign adult site. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T21:42:48",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Trump calls Somali immigrants ‘garbage’ as US reportedly targets Minnesota community",
    "url": "https://www.theguardian.com/us-news/2025/dec/02/trump-somali-immigrants-minnesota",
    "snippet": "US president’s xenophobic rant comes amid reports of ramped-up deportation efforts in Ilhan Omar’s district US politics live – latest updates Donald Trump on Tuesday called Somali immigrants “garbage” and said they should be sent back home in a rant that came as the administration is reportedly increasing immigration enforcement against undocumented Somalis in Minnesota. In a xenophobic rant during a cabinet meeting, Trump went off on Somalis and Ilhan Omar, the congressional representative who is from Somalia and is a US citizen. He said Somalia “stinks” and is “no good for a reason”. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T21:20:30",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Can former colonial powers be held accountable for past atrocities?",
    "url": "https://www.aljazeera.com/video/inside-story/2025/12/2/can-former-colonial-powers-be-held-accountable-for-past-atrocities?traffic_source=rss",
    "snippet": "Algerian Foreign Minister Ahmed Attaf said Algeria's experience under French rule highlighted the need for compensation.",
    "source": "aljazeera.com",
    "time": "2025-12-02T21:07:45",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "FTC settlement requires Illuminate to delete unnecessary student data",
    "url": "https://www.bleepingcomputer.com/news/security/ftc-settlement-requires-illuminate-to-delete-unnecessary-student-data/",
    "snippet": "The Federal Trade Commission (FTC) is proposing that education technology provider Illuminate Education to delete unnecessary student data and improve its security to settle allegations related to an incident in 2021 that exposed info of 10 million students. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T20:50:13",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "QTCinderella reveals full host and performer lineup for the Streamer Awards 2025",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/qtcinderella-reveals-full-host-and-performer-lineup-for-the-streamer-awards-2025/articleshow/125728131.cms",
    "snippet": "QTCinderella has revealed the full host and performer lineup for the 2025 Streamer Awards, scheduled for December 6 at Los Angeles’ Wiltern Theatre. The dynamic roster features returning favorites and new faces, including co-host Maya Higa and performers Ironmouse, Good Kid, and Ty Dolla $ign, promising an inclusive and energetic celebration of streaming culture.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T20:49:36",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "‘Antisemite of the Year’: Pro-Israel group slams kids’ YouTuber Ms. Rachel",
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/2/antisemite-of-the-year-pro-israel-group-slams-kids-youtuber-ms-rachel?traffic_source=rss",
    "snippet": "Kids’ Youtuber Rachel Accurso, known as Ms. Rachel, has been nominated for ‘Antisemite of the Year’ by StopAntisemitism.",
    "source": "aljazeera.com",
    "time": "2025-12-02T20:43:38",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Putin meets with Witkoff, Kushner to discuss Ukraine peace plan",
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/2/putin-meets-with-witkoff-kushner-to-discuss-ukraine-peace-plan?traffic_source=rss",
    "snippet": "Russian President Vladimir Putin met with US envoy Steve Witkoff to discuss the Ukraine peace effort.",
    "source": "aljazeera.com",
    "time": "2025-12-02T20:41:01",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "MAGA ally pushes to end dual citizenship, not realising Melania and Barron Trump would be caught in the crossfire",
    "url": "https://timesofindia.indiatimes.com/world/us/maga-ally-pushes-to-end-dual-citizenship-not-realising-melania-and-barron-trump-would-be-caught-in-the-crossfire/articleshow/125727781.cms",
    "snippet": "",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T20:24:44",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Politician Ayachi Hammami latest arrest in Tunisia opposition crackdown",
    "url": "https://www.aljazeera.com/news/2025/12/2/politician-ayachi-hammami-latest-arrest-in-tunisia-opposition-crackdown?traffic_source=rss",
    "snippet": "Tunisia opposition says charges are fabricated, as police enforce a five-year prison sentence.",
    "source": "aljazeera.com",
    "time": "2025-12-02T20:23:44",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Rare Fabergé egg fetches record £22.9m at London auction",
    "url": "https://www.bbc.com/news/articles/cg7v24m1leyo?at_medium=RSS&at_campaign=rss",
    "snippet": "The Imperial Winter Egg with 4,500 diamonds was commissioned by Russia's Tsar Nicholas II in 1913.",
    "source": "bbc.com",
    "time": "2025-12-02T20:16:22",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Hegseth vows more boat strikes amid accusations he broke the law",
    "url": "https://www.aljazeera.com/video/newsfeed/2025/12/2/hegseth-vows-more-boat-strikes-amid-accusations-he-broke-the-law?traffic_source=rss",
    "snippet": "US Secretary of Defense Pete Hegseth is vowing to continue military strikes on vessels in the Caribbean Sea.",
    "source": "aljazeera.com",
    "time": "2025-12-02T20:11:07",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Hasan Piker honored with Trinity College Dublin's Gold Medal of Honorary Patronage",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/hasan-piker-honored-with-trinity-college-dublins-gold-medal-of-honorary-patronage/articleshow/125727780.cms",
    "snippet": "Hasan Piker, known as HasanAbi, will receive Trinity College Dublin's prestigious Gold Medal of Honorary Patronage. The University Philosophical Society recognized his journalistic roots, honest commentary, and ability to dissect news with clarity. This honor highlights the growing influence of online commentators in shaping public discourse and marks a significant milestone in Piker's career.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T20:06:40",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Rahmanullah Lakanwal pleads not guilty in US National Guard shooting",
    "url": "https://www.aljazeera.com/news/2025/12/2/rahmanullah-lakanwal-pleads-not-guilty-in-us-national-guard-shooting?traffic_source=rss",
    "snippet": "Judge orders suspected attacker held without bond after fatal shooting in Washington, DC caused 'sheer terror'.",
    "source": "aljazeera.com",
    "time": "2025-12-02T19:57:18",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "ChatGPT is down worldwide, conversations dissapeared for users",
    "url": "https://www.bleepingcomputer.com/news/artificial-intelligence/chatgpt-is-down-worldwide-conversations-dissapeared-for-users/",
    "snippet": "OpenAI's AI-powered ChatGPT is down worldwide with users receiving errors when attempting to access chats, with no reasons currently given. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T19:52:16",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Charlie Kirk takes the No. 1 spot on Wikipedia’s most-read pages — here’s the full top 10",
    "url": "https://timesofindia.indiatimes.com/etimes/trending/charlie-kirk-takes-the-no-1-spot-on-wikipedias-most-read-pages-heres-the-full-top-10/articleshow/125727423.cms",
    "snippet": "",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T19:46:34",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "OECD warns tariffs, AI will test resilience of the global economy",
    "url": "https://www.aljazeera.com/economy/2025/12/2/oecd-warns-tariffs-ai-will-test-resilience-of-the-global-economy?traffic_source=rss",
    "snippet": "The organisation warns that President Donald Trump has put US fiscal policy on an unsustainable trajectory.",
    "source": "aljazeera.com",
    "time": "2025-12-02T19:40:37",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Twitch under fire as Asmongold demands Amazon intervention over Nina Lin controversy",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/twitch-under-fire-as-asmongold-demands-amazon-intervention-over-nina-lin-controversy/articleshow/125727143.cms",
    "snippet": "Prominent streamer Asmongold has urged Amazon to take direct control of Twitch following a moderation scandal involving IRL streamer Nina Lin.  Lin's shoplifting incident, coupled with prior policy violations, has sparked outrage over perceived lenient punishments, fueling calls for Amazon's intervention to ensure consistent rule enforcement and restore community trust.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T19:21:10",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Global heating and other human activity are making Asia’s floods more lethal",
    "url": "https://www.theguardian.com/world/2025/dec/02/global-heating-and-other-human-activity-are-making-asias-floods-more-lethal",
    "snippet": "Much improved response systems are struggling to cope with ever more powerful and destructive storms Death toll from Indonesia floods passes 700 as 1 million evacuated Families stranded on their rooftops. Homes buried by fast-flowing mud. Jagged brown craters scarring lush green hillsides. The scenes are the result of a series of cyclones and storms in a heavy monsoon season that have struck Asia with torrential rains, gutting essential infrastructure and reshaping landscapes. The violent weather has killed at least 1,200 people in the past week and forced a million to flee without knowing whether their homes will still be standing when they go back. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T19:19:02",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Shai-Hulud 2.0 NPM malware attack exposed up to 400,000 dev secrets",
    "url": "https://www.bleepingcomputer.com/news/security/shai-hulud-20-npm-malware-attack-exposed-up-to-400-000-dev-secrets/",
    "snippet": "The second Shai-Hulud attack last week exposed around 400,000 raw secrets after infecting hundreds of packages in the NPM (Node Package Manager) registry and publishing stolen data in 30,000 GitHub repositories. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T19:06:20",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "'No 'American Dream' when H-1Bs can come': Ex-DOGE advisor hits back at Vivek Ramaswamy",
    "url": "https://timesofindia.indiatimes.com/world/us/no-american-dream-when-h-1bs-can-come-ex-doge-advisor-hits-back-at-vivek-ramaswamy/articleshow/125724710.cms",
    "snippet": "",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T18:53:39",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Trump frees ex-Honduran president from prison as country awaits knife-edge election result",
    "url": "https://www.theguardian.com/world/2025/dec/02/trump-intervention-honduras-presidential-vote-count-stalls-nasry-asfura",
    "snippet": "Release of convicted cocaine trafficker Juan Orlando Hernández is latest US interference in election and comes despite Trump’s apparent ‘war on drugs’ Analysis: Trump’s pardon of Honduras’s ex-president shows counter-drug effort is ‘based on lies and hypocrisy’ A former president of Honduras who was convicted of drug trafficking has walked free from a US prison after receiving a pardon from Donald Trump, as the country’s presidential election remained on a knife edge with the US-backed candidate leading by 515 votes. Juan Orlando Hernández, who was sentenced to 45 years in prison for allegedly creating “a cocaine superhighway to the United States”, was released from a West Virginia prison after Trump’s intervention, Hernández’s wife confirmed on Tuesday. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T18:31:07",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "No role in renovations, says Danish facility management group amid scrutiny over Hong Kong fire",
    "url": "https://www.straitstimes.com/asia/east-asia/danish-facilities-group-iss-falls-on-link-to-towers-in-deadly-hong-kong-fire",
    "snippet": "ISS said its unit had been the property manager for the building complex where at least 156 people died.",
    "source": "straitstimes.com",
    "time": "2025-12-02T18:10:14",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Watch: Japan’s PM Sanae Takaichi quotes famous manga and anime ‘Attack on Titan’",
    "url": "https://timesofindia.indiatimes.com/world/rest-of-world/watch-japans-pm-sanae-takaichi-quotes-famous-manga-and-anime-attack-on-titan/articleshow/125724137.cms",
    "snippet": "",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T18:05:38",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "British women stranded by landslides in Sri Lankan mountains running out of food and water, daughter says",
    "url": "https://www.theguardian.com/world/2025/dec/02/british-women-stranded-by-landslides-in-sri-lankan-mountains-running-out-of-food-and-water-daughter-says",
    "snippet": "Friends Melanie Watters and Janine Reid have been trapped in Pussellawa since Thursday Two British women stranded by landslides in Sri Lanka’s tea mountains are running out of food and water, the daughter of one of them has said, as officials reported that the death toll of Cyclone Ditwah has reached 465. Melanie Watters, 54, and her friend Janine Reid, 55, both from London, were being driven through the mountains from Kandy in central Sri Lanka on Thursday when the road in front of them was swamped, sending a bus nearby over a cliff-edge. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T18:04:07",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Nina Lin refuses to say sorry after Target shoplifting clip goes viral while Asmongold urges Twitch to act",
    "url": "https://timesofindia.indiatimes.com/world/us-streamers/nina-lin-refuses-to-say-sorry-after-target-shoplifting-clip-goes-viral-while-asmongold-urges-twitch-to-act/articleshow/125724104.cms",
    "snippet": "Twitch streamer Nina Lin faces backlash after a viral video allegedly shows her shoplifting from Target.  Despite widespread accusations, Lin dismissed the incident on stream, claiming no harm was done and urging viewers to calm down.  Fellow streamer Asmongold questioned Twitch's inaction, amplifying the controversy as fans await a platform response.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T17:27:22",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Why is Trump threatening Venezuela's Maduro?",
    "url": "https://www.bbc.com/news/articles/c93n4nx5yqro?at_medium=RSS&at_campaign=rss",
    "snippet": "We look at what is behind the deployment of a large US military force to within striking distance of Venezuela.",
    "source": "bbc.com",
    "time": "2025-12-02T17:06:32",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Ukrainians in war-ravaged Donbas weigh prospects of peace deal",
    "url": "https://www.bbc.com/news/articles/cpq47derx2vo?at_medium=RSS&at_campaign=rss",
    "snippet": "While many Ukrainians believe they have sacrificed too much for their country to lose territory to Russia, others are desperate for the war to end.",
    "source": "bbc.com",
    "time": "2025-12-02T17:00:23",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Nigeria grants asylum to Guinea-Bissau presidential candidate after coup",
    "url": "https://www.bbc.com/news/articles/ce3wq2zznz1o?at_medium=RSS&at_campaign=rss",
    "snippet": "Nigeria says it is sheltering Fernando Dias in its embassy in Bissau, citing an imminent threat to his life.",
    "source": "bbc.com",
    "time": "2025-12-02T16:51:10",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Pope prays at Beirut port blast site on last day of Lebanon visit",
    "url": "https://www.bbc.com/news/articles/cn41jge1990o?at_medium=RSS&at_campaign=rss",
    "snippet": "Pope Leo XIV demanded justice for the more than 200 victims of the disaster, at the end of his three-day visit to Lebanon.",
    "source": "bbc.com",
    "time": "2025-12-02T16:47:19",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Publisher condemns ‘violent’ use of Franklin the Turtle after Hegseth’s boat strike post",
    "url": "https://www.theguardian.com/us-news/2025/dec/02/pete-hegseth-franklin-the-turtle",
    "snippet": "US defense secretary posted meme depicting beloved children’s character aiming rocket launcher at set of boats Pete Hegseth told US soldiers in Iraq to ignore legal advice on rules of engagement A post on social media by US defense secretary Pete Hegseth , depicting a beloved children’s character aiming a rocket launcher at a cluster of boats, has elicited condemnation from the book’s Canadian publisher. Hegseth’s post of the mocked cover of a Franklin the Turtle book titled Franklin Targets Narco Terrorists prompted disbelief and outrage. The image shows a smiling anthropomorphic turtle in military helmet and vest, with a US flag on his arm and a drug-laden boat exploding in the background. “For your Christmas wish list,” Hegseth wrote as the caption. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T16:42:43",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Thousands of rounds of German army ammunition stolen from lorry",
    "url": "https://www.bbc.com/news/articles/c0q5n3x0jn9o?at_medium=RSS&at_campaign=rss",
    "snippet": "The theft reportedly took place after the driver left his truck in an unguarded parking lot overnight.",
    "source": "bbc.com",
    "time": "2025-12-02T16:37:23",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Microsoft Defender portal outage disrupts threat hunting alerts",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-defender-portal-outage-blocks-access-to-security-alerts/",
    "snippet": "Microsoft is working to mitigate an ongoing incident that has been blocking access to some Defender XDR portal capabilities for the past 10 hours. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T16:10:06",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "US Navy admiral ordered second  deadly Venezuela boat strike, White House says",
    "url": "https://www.bbc.com/news/articles/c0r95q9kv1go?at_medium=RSS&at_campaign=rss",
    "snippet": "The strikes, authorised by Defence Secretary Pete Hegseth, have raised fresh legality questions - but the White House says laws have been followed.",
    "source": "bbc.com",
    "time": "2025-12-02T15:38:06",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Indonesia to investigate alleged illegal gold mining near Komodo Island",
    "url": "https://www.straitstimes.com/asia/se-asia/indonesia-to-investigate-alleged-illegal-gold-mining-near-komodo-island",
    "snippet": "Gold mining could pose a threat to the endangered Komodo dragon, the world's largest living lizard.",
    "source": "straitstimes.com",
    "time": "2025-12-02T15:25:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Cybercrime Goes SaaS: Renting Tools, Access, and Infrastructure",
    "url": "https://www.bleepingcomputer.com/news/security/cybercrime-goes-saas-renting-tools-access-and-infrastructure/",
    "snippet": "Cybercrime has fully shifted to a subscription model, with phishing kits, Telegram OTP bots, infostealer logs, and even RATs now rented like SaaS tools. Varonis explains how this \"crime-as-a-service\" economy lowers the barrier to entry and gives low-skill attackers on-demand access to advanced capabilities. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T15:10:20",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Indonesia, Dutch sign deal to repatriate two convicts, one on death row",
    "url": "https://www.straitstimes.com/asia/se-asia/indonesia-dutch-sign-deal-to-repatriate-two-convicts-one-on-death-row",
    "snippet": "In the past year, Indonesia has repatriated a number of foreigners on death row or sentenced to life imprisonment.",
    "source": "straitstimes.com",
    "time": "2025-12-02T15:00:19",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Zambian-American influencer sentenced to 18 months for hate speech",
    "url": "https://www.bbc.com/news/articles/cvgqnklqge7o?at_medium=RSS&at_campaign=rss",
    "snippet": "Known as \"One Boss Lady\",  Ethel Chisono Edwards has become known for her rants about the president.",
    "source": "bbc.com",
    "time": "2025-12-02T14:58:51",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "North Korea lures engineers to rent identities in fake IT worker scheme",
    "url": "https://www.bleepingcomputer.com/news/security/north-korea-lures-engineers-to-rent-identities-in-fake-it-worker-scheme/",
    "snippet": "In an unprecedented intelligence operation, security researchers exposed how North Korean IT recruiters target and lure developers into renting their identities for illicit fundraising. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T14:57:26",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "‘AI nightmare’: Google CEO Sundar Pichai reveals the one threat that keeps him awake at night",
    "url": "https://timesofindia.indiatimes.com/technology/tech-news/ai-nightmare-google-ceo-sundar-pichai-reveals-the-one-threat-that-keeps-him-awake-at-night/articleshow/125721392.cms",
    "snippet": "Google CEO Sundar Pichai expresses deep concern over advanced deepfake technology. He believes this AI development poses a significant threat, making it difficult to distinguish real from fake content. This could lead to widespread deception, impacting everything from personal scams to political campaigns. Pichai urges swift action to establish safeguards against AI misuse.",
    "source": "timesofindia.indiatimes.com",
    "time": "2025-12-02T14:53:31",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Google fixes two Android zero days exploited in attacks, 107 flaws",
    "url": "https://www.bleepingcomputer.com/news/security/google-fixes-two-android-zero-days-exploited-in-attacks-107-flaws/",
    "snippet": "Google has released the December 2025 Android security bulletin, addressing 107 vulnerabilities, including two flaws actively exploited in targeted attacks. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T14:36:44",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Revealed: Mexico’s industrial boomtown is making goods for the US. Residents say they’re ‘breathing poison’",
    "url": "https://www.theguardian.com/us-news/2025/dec/02/monterrey-mexico-air-quality-industrial-pollution",
    "snippet": "Polluting facilities in Monterrey, which has close ties to the US, are pumping toxic heavy metals into the city’s air and threatening residents’ health Leer en español en Quinto Elemento Lab An industrial boom in a US manufacturing hub in Mexico is contributing to a massive air pollution crisis that is threatening residents’ health, according to new research by the Guardian and Quinto Elemento Lab. The polluting facilities in Monterrey include factories that are operated by companies from around the world – including the US, Europe, Asia and Mexico – but export largely to the US. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T14:00:34",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Fake Calendly invites spoof top brands to hijack ad manager accounts",
    "url": "https://www.bleepingcomputer.com/news/security/fake-calendly-invites-spoof-top-brands-to-hijack-ad-manager-accounts/",
    "snippet": "An ongoing phishing campaign impersonates popular brands, such as Unilever, Disney, MasterCard, LVMH, and Uber, in Calendly-themed lures to steal Google Workspace and Facebook business account credentials. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T14:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Microsoft: KB5070311 triggers File Explorer white flash in dark mode",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-kb5070311-triggers-file-explorer-bright-white-flashes-in-dark-mode/",
    "snippet": "Microsoft has confirmed that the KB5070311 preview update is triggering bright white flashes when launching the File Explorer in dark mode on Windows 11 systems. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T13:39:51",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "University of Pennsylvania confirms new data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-pennsylvania-confirms-data-theft-after-oracle-ebs-hack/",
    "snippet": "​The University of Pennsylvania (Penn) has confirmed a new data breach after attackers stole documents containing personal information from its Oracle E-Business Suite servers in August. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T12:55:59",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Death toll from Indonesia floods passes 700 as 1 million evacuated",
    "url": "https://www.theguardian.com/world/2025/dec/02/indonesia-floods-one-million-people-evacuated-death-toll-rises",
    "snippet": "About 3.2 million people on Sumatra island have been affected, 2,600 have been injured and 504 are missing The number of people killed by floods and landslides on Indonesia’s Sumatra island rose to 708 on Tuesday, the country’s disaster agency said, with 504 people missing. The toll was a sharp increase from the 604 dead reported by the agency on Monday. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-02T12:19:25",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Bulgaria ditches budget plan after tens of thousands join protests",
    "url": "https://www.bbc.com/news/articles/cjezwzw088jo?at_medium=RSS&at_campaign=rss",
    "snippet": "Demonstrators said the plan - the country's first in euros - attempted to hide widespread government corruption.",
    "source": "bbc.com",
    "time": "2025-12-02T12:04:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Mirion Medical EC2 Software NMIS BioDose",
    "url": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.7 ATTENTION : Exploitable remotely/low attack complexity Vendor : Mirion Medical Equipment : EC2 Software NMIS BioDose Vulnerabilities : Incorrect Permission Assignment for Critical Resource, Use of Client-Side Authentication, Use of Hard-coded Credentials 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to modify program executables, gain access to sensitive information, gain unauthorized access to the application, and execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Mirion Medical products are affected: EC2 Software NMIS BioDose: Versions prior to 23.0 3.2 VULNERABILITY OVERVIEW 3.2.1 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions' installation directory paths by default have insecure file permissions, which in certain deployment scenarios can enable users on client workstations to modify the program executables and libraries. CVE-2025-64642 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64642 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:L/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous version installations where the embedded Microsoft SQLServer Express is used are exposed in the Windows share accessed by clients in networked installs. By default, this directory has insecure directory paths that allow access to the SQL Server database and configuration files, which can contain sensitive data. CVE-2025-64298 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64298 . A base score of 8.6 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.3 USE OF CLIENT-SIDE AUTHENTICATION CWE-603 NMIS/BioDose V22.02 and previous versions rely on a common SQL Server user account to access data in the database. User access in the client application is restricted by a password authentication check in the client software but the underlying database connection always has access. The latest version of NMIS/BioDose introduces an option to use Windows user authentication with the database, which would restrict this database connection. CVE-2025-61940 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-61940 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.4 USE OF HARD-CODED CREDENTIALS CWE-798 NMIS/BioDose software V22.02 and previous versions contain executable binaries with plain text hard-coded passwords. These hard-coded passwords could allow unauthorized access to both the application and database. CVE-2025-64778 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-64778 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.5 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions rely on a Microsoft SQL Server database. The SQL user account 'nmdbuser' and other created accounts by default have the sysadmin role. This can lead to remote code execution through the use of certain built-in stored procedures. CVE-2025-62575 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-62575 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Joe Dillon reported these vulnerabilities to Mirion Medical. 4. MITIGATIONS Mirion Medical recommends users update to V23.0 or later. Users with an active support contract should update to the latest version through the software or users can contact Mirion Medical support directly. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "CISA Releases Five Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-releases-five-industrial-control-systems-advisories",
    "snippet": "CISA released five Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-336-01 Industrial Video & Control Longwatch ICSA-25-336-02 Iskra iHUB and iHUB Lite ICSMA-25-336-01 Mirion Medical EC2 Software NMIS BioDose ICSA-25-201-01 Mitsubishi Electric CNC Series (Update A) ICSA-23-157-02 Mitsubishi Electric MELSEC iQ-R Series/iQ-F Series (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Industrial Video & Control Longwatch",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Industrial Video & Control Equipment : Longwatch Vulnerability : IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an unauthenticated attacker to gain remote code execution with elevated privileges. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Industrial Video & Control Longwatch, a video surveillance and monitoring system, are affected: Longwatch: Versions 6.309 to 6.334 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94 A vulnerability in Longwatch devices allows unauthenticated HTTP GET requests to execute arbitrary code via an exposed endpoint, due to the absence of code signing and execution controls. Exploitation results in SYSTEM-level privileges. CVE-2025-13658 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13658 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater Systems COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Concerned OT Engineer reported this vulnerability to CISA. 4. MITIGATIONS Industrial Video & Control recommends users running versions 6.309 to 6.334 should upgrade to version 6.335 or later to ensure protection against this vulnerability. For more details, view Industrial Video & Control's advisory . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-adds-two-known-exploited-vulnerabilities-catalog",
    "snippet": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-48572 Android Framework Privilege Escalation Vulnerability CVE-2025-48633 Android Framework Information Disclosure Vulnerability These types of vulnerabilities are a frequent attack vector for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of known Common Vulnerabilities and Exposures (CVEs) that carry significant risk to the federal enterprise. BOD 22-01 requires Federal Civilian Executive Branch (FCEB) agencies to remediate identified vulnerabilities by the due date to protect FCEB networks against active threats. See the BOD 22-01 Fact Sheet for more information. Although BOD 22-01 only applies to FCEB agencies, CISA strongly urges all organizations to reduce their exposure to cyberattacks by prioritizing timely remediation of KEV Catalog vulnerabilities as part of their vulnerability management practice. CISA will continue to add vulnerabilities to the catalog that meet the specified criteria .",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Iskra iHUB and iHUB Lite",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Iskra Equipment : iHUB and iHUB Lite Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could allow a remote attacker to reconfigure devices, update firmware, and manipulate connected systems without any credentials. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Iskra iHUB and iHUB Lite, a Smart Metering Gateway and Data Concentrator, are affected: iHUB and iHUB Lite: All Versions 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 The Iskra iHUB and iHUB Lite smart metering gateway exposes its web management interface without requiring authentication, allowing unauthenticated users to access and modify critical device settings. CVE-2025-13510 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N ). A CVSS v4 score has also been calculated for CVE-2025-13510 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Slovenia 3.4 RESEARCHER Souvik Kandar reported this vulnerability to CISA. 4. MITIGATIONS Iskra did not respond to CISA's request for coordination. Contact Iskra using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Windows 11 KB5070311 update fixes File Explorer freezes, search issues",
    "url": "https://www.bleepingcomputer.com/news/microsoft/windows-11-kb5070311-update-fixes-file-explorer-freezes-search-issues/",
    "snippet": "​​Microsoft has released the KB5070311 preview cumulative update for Windows 11 systems, which includes 49 changes, including fixes for File Explorer freezes and search issues. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-02T11:19:31",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "India tells smartphone makers to put state-run cyber safety app on new devices",
    "url": "https://www.bbc.com/news/articles/cedxyvx74p4o?at_medium=RSS&at_campaign=rss",
    "snippet": "India wants all smartphone makers to pre-install new devices with a state-owned cyber security app.",
    "source": "bbc.com",
    "time": "2025-12-02T10:01:18",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Hong Kong leader orders investigation into deadly fire that killed 151",
    "url": "https://www.bbc.com/news/articles/ce8ng18p7v3o?at_medium=RSS&at_campaign=rss",
    "snippet": "The fire is the deadliest the city has seen in more than 70 years.",
    "source": "bbc.com",
    "time": "2025-12-02T05:58:21",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Pavarotti statue frozen knee-deep in ice rink strikes wrong note in Italy",
    "url": "https://www.bbc.com/news/articles/cre3q9edqx8o?at_medium=RSS&at_campaign=rss",
    "snippet": "The opera legend's widow said the town had made an \"absurd decision\" after it also encouraged skaters to high five the statue.",
    "source": "bbc.com",
    "time": "2025-12-02T05:19:12",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Mangione in court as lawyers seek to rule out notebook, gun and other key evidence",
    "url": "https://www.bbc.com/news/articles/c33mz477p4po?at_medium=RSS&at_campaign=rss",
    "snippet": "A legal expert explains how the defence could stand to gain even if their longshot bid fails this week.",
    "source": "bbc.com",
    "time": "2025-12-01T21:56:30",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Five South Africans in court over alleged recruitment for Russia’s war in Ukraine",
    "url": "https://www.theguardian.com/world/2025/dec/01/south-africans-court-alleged-recruitment-russia-war-ukraine",
    "snippet": "Suspects arrested after tipoff over accusation that 17 South Africans were tricked on to frontlines of the conflict Five South Africans have appeared in court on charges relating to recruitment and fighting for Russia in its war with Ukraine, amid allegations that 17 South Africans had been tricked on to the frontlines of the conflict. A female suspect was arrested on Thursday on her return to South Africa at OR Tambo international airport outside Johannesburg, police said. Three suspects were arrested at the airport on Friday and another on Saturday. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-01T14:43:19",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Aid cuts have shaken HIV/Aids care to its core – and will mean millions more infections ahead",
    "url": "https://www.theguardian.com/global-development/2025/dec/01/global-health-hiv-aids-funding-cuts-infections-prevention",
    "snippet": "Reports highlight devastating impact of slashed funding, especially in parts of Africa, that could lead to 3.3m new HIV infections by 2030 In Mozambique, a teenage rape victim sought care at a health clinic only to find it closed. In Zimbabwe, Aids-related deaths have risen for the first time in five years. In Ethiopia and the Democratic Republic of the Congo (DRC), patients with suspected HIV went undiagnosed due to test-kit stocks running out. Stories of the devastating impact of US, British and wider European aid cuts on the fight against HIV – particularly in sub-Saharan Africa – continue to mount as 2025 comes to an end, and are set out in a series of reports released in the past week. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-12-01T06:00:27",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "African leaders push for recognition of colonial crimes and reparations",
    "url": "https://www.theguardian.com/world/2025/nov/30/african-leaders-push-for-recognition-of-colonial-crimes-and-reparations",
    "snippet": "Algerian foreign minister says African countries and peoples continue to pay a heavy price for colonialism African leaders are pushing to have colonial-era crimes recognised, criminalised and addressed through reparations. At a conference in the Algerian capital, Algiers, diplomats and leaders convened to advance an African Union resolution passed at a meeting earlier this year calling for justice and reparations for victims of colonialism. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-11-30T21:40:48",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Jacob Zuma’s daughter resigns amid claims South Africans tricked to fight for Russia",
    "url": "https://www.theguardian.com/world/2025/nov/28/jacob-zuma-daughter-resigns-claims-south-africans-tricked-fight-russia",
    "snippet": "Duduzile Zuma-Sambudla quits as MP after being accused of recruiting 17 men who are trapped in war-torn Ukraine A daughter of the former South African president Jacob Zuma has resigned as an MP, after being accused of tricking 17 South African men into fighting for Russia in Ukraine by telling them they were travelling to Russia to train as bodyguards for the Zumas’ uMkhonto weSizwe (MK) party. Duduzile Zuma-Sambudla, 43, the most visible and active in politics of her siblings, volunteered to resign and step back from public roles while cooperating with a police investigation and working to bring the men home, the MK chair, Nkosinathi Nhleko, said at a press conference in Durban. Continue reading...",
    "source": "theguardian.com",
    "time": "2025-11-28T15:28:33",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/28/cisa-adds-one-known-exploited-vulnerability-catalog",
    "snippet": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2021-26829 OpenPLC ScadaBR Cross-site Scripting Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of known Common Vulnerabilities and Exposures (CVEs) that carry significant risk to the federal enterprise. BOD 22-01 requires Federal Civilian Executive Branch (FCEB) agencies to remediate identified vulnerabilities by the due date to protect FCEB networks against active threats. See the BOD 22-01 Fact Sheet for more information. Although BOD 22-01 only applies to FCEB agencies, CISA strongly urges all organizations to reduce their exposure to cyberattacks by prioritizing timely remediation of KEV Catalog vulnerabilities as part of their vulnerability management practice. CISA will continue to add vulnerabilities to the catalog that meet the specified criteria .",
    "source": "cisa.gov",
    "time": "2025-11-28T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "CISA Releases Seven Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/25/cisa-releases-seven-industrial-control-systems-advisories",
    "snippet": "CISA released seven Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-329-01 Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, Cobalt Share ICSA-25-329-02 Rockwell Automation Arena Simulation ICSA-25-329-03 Zenitel TCIV-3+ ICSA-25-329-04 Opto 22 groov View ICSA-25-329-05 Festo Compact Vision System, Control Block, Controller, and Operator Unit products ICSA-25-329-06 SiRcom SMART Alert (SiSA) ICSA-22-333-05 Mitsubishi Electric FA Engineering Software (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "SiRcom SMART Alert (SiSA)",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-06",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.8 ATTENTION : Exploitable remotely/low attack complexity Vendor : SiRcom Equipment : SMART Alert (SiSA) Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could enable an attacker to remotely activate or manipulate emergency sirens. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of SiRcom SMART Alert (SiSA), a central control system, are affected: SMART Alert (SiSA): Version 3.0.48 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 SiRcom SMART Alert (SiSA) allows unauthorized access to backend APIs. This allows an unauthenticated attacker to bypass the login screen using browser developer tools, gaining access to restricted parts of the application. CVE-2025-13483 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13483 . A base score of 8.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Emergency Services, Government Services and Facilities, Defense Industrial Base COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Souvik Kandar of Microsec (microsec.io) reported this vulnerability to CISA. 4. MITIGATIONS SiRcom did not respond to CISA's request for coordination. Contact SiRcom using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Opto 22 groov View",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-04",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 6.1 ATTENTION : Exploitable remotely/Low attack complexity Vendor : Opto 22 Equipment : groov View Vulnerability : Exposure of Sensitive Information Through Metadata 2. RISK EVALUATION Successful exploitation of this vulnerability could result in credential exposure, key exposure, and privilege escalation. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of groov View are affected: groov View Server for Windows: Versions R1.0a to R4.5d GRV-EPIC-PR1 Firmware: Versions prior to 4.0.3 GRV-EPIC-PR2 Firmware: Versions prior to 4.0.3 3.2 VULNERABILITY OVERVIEW 3.2.1 Exposure of Sensitive Information Through Metadata CWE-1230 The users endpoint in the groov View API returns a list of all users and associated metadata including their API keys. This endpoint requires an Editor role to access and will display API keys for all users, including Administrators. CVE-2025-13084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L ). A CVSS v4 score has also been calculated for CVE-2025-13084 . A base score of 6.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:P/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Nik Tsytsarkin, Ismail Aydemir, and Ryan Hall of Meta reported this vulnerability to CISA. 4. MITIGATIONS Opto 22 has published a patch to address this vulnerability and recommends that users upgrade to groov View Server for Windows Version R4.5e and GRV-EPIC Firmware Version 4.0.3. Additional information is available from Opto 22 here . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, Cobalt Share",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.4 ATTENTION : Low attack complexity Vendor : Ashlar-Vellum Equipment : Cobalt, Xenon, Argon, Lithium, Cobalt Share Vulnerabilities : Out-of-Bounds Write, Heap-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to disclose information or execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Ashlar-Vellum products are affected: Cobalt: Versions 12.6.1204.207 and prior Xenon: Versions 12.6.1204.207 and prior Argon: Versions 12.6.1204.207 and prior Lithium: Versions 12.6.1204.207 and prior Cobalt Share: Versions 12.6.1204.207 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 OUT-OF-BOUNDS WRITE CWE-787 An Out-of-Bounds Write vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65084 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 HEAP-BASED BUFFER OVERFLOW CWE-122 A Heap-based Buffer Overflow vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65085 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65085 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported these vulnerabilities to CISA. 4. MITIGATIONS Ashlar-Vellum recommends users update to the following versions: Cobalt: Versions 12.6.1204.208 or higher Xenon: Versions 12.6.1204.208 or higher Argon: Versions 12.6.1204.208 or higher Lithium: Versions 12.6.1204.208 or higher Cobalt Share: Versions 12.6.1204.208 or higher CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Zenitel TCIV-3+",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-03",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 10.0 ATTENTION: Exploitable remotely/low attack complexity Vendor: Zenitel Equipment: TCIV-3+ Vulnerabilities: OS Command Injection, Out-of-bounds Write, Cross-site Scripting 2. RISK EVALUATION Successful exploitation of these vulnerabilities could result in arbitrary code execution or cause a denial-of-service condition. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of TCIV-3+ are affected: TCIV-3+: All versions prior to 9.3.3.0 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to improper input validation. The application accepts a parameter directly from user input without verifying it is a valid IP address or filtering potentially malicious characters. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64126 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64126 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.2 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to insufficient sanitization of user-supplied input. The application accepts parameters that are later incorporated into OS commands without adequate validation. This could allow an unauthenticated attacker to execute arbitrary commands remotely. CVE-2025-64127 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64127 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.3 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to incomplete validation of user-supplied input. Validation fails to enforce sufficient formatting rules, which could permit attackers to append arbitrary data. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64128 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64128 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.4 OUT-OF-BOUNDS WRITE CWE-787 The affected product is vulnerable to an out-of-bounds write vulnerability, which could allow a remote attacker to crash the device. CVE-2025-64129 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64129 . A base score of 7.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N ). 3.2.5 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79 The affected product is vulnerable to a reflected cross-site scripting vulnerability, which could allow a remote attacker to execute arbitrary JavaScript on the victim's browser. CVE-2025-64130 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64130 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Communications COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Belgium 3.4 RESEARCHER Nir Tepper and Noam Moshe of Claroty Team82 reported these vulnerabilities to CISA. 4. MITIGATIONS Zenitel recommends users to upgrade to Version 9.3.3.0 or later . CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Rockwell Automation Arena Simulation",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.1 ATTENTION : Exploitable from a local network Vendor : Rockwell Automation Equipment : Arena Simulation Vulnerability : Stack-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of this vulnerability could allow local attackers to execute arbitrary code on affected installations of Arena. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Rockwell Automation products are affected: Arena Simulation: Version 16.20.10 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121 Arena suffers from a stack-based buffer overflow vulnerability. The specific flaw exists within the parsing of DOE files. Local attackers are able to exploit this issue to potentially execute arbitrary code on affected installations of Arena. Exploiting the vulnerability requires opening a malicious DOE file. CVE-2025-11918 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.0 has been calculated; the CVSS vector string is ( AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-11918 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:H/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported this vulnerability to CISA. 4. MITIGATIONS Rockwell Automation recommends users upgrade Arena Simulation to version 16.20.11 or later . Users who are unable to upgrade the affected software to a correct version should use Rockwell Automation's security best practices . For more information about this issue, see advisory SD1763 on the Rockwell Automation security page. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "AMER",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "​​Spyware Allows Cyber Threat Actors to Target Users of Messaging Applications​",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/24/spyware-allows-cyber-threat-actors-target-users-messaging-applications",
    "snippet": "CISA is aware of multiple cyber threat actors actively leveraging commercial spyware to target users of mobile messaging applications (apps). 1 These cyber actors use sophisticated targeting and social engineering techniques to deliver spyware and gain unauthorized access to a victim’s messaging app, facilitating the deployment of additional malicious payloads that can further compromise the victim’s mobile device. These cyber actors use tactics such as: Phishing and malicious device-linking QR codes to compromise victim accounts and link them to actor-controlled devices. Zero-click exploits, 2 which require no direct action from the device user. Impersonation 3 of messaging app platforms, such as Signal and WhatsApp. While current targeting remains opportunistic, evidence suggests these cyber actors focus on high-value individuals, such as current and former high-ranking government, military, and political officials, 4 as well as civil society organizations (CSOs) and individuals across the United States, 5 Middle East, 6 and Europe. 7 CISA strongly encourages messaging app users to review the updated Mobile Communications Best Practice Guidance and Mitigating Cyber Threats with Limited Resources: Guidance for Civil Society for steps to protect mobile communications and messaging apps, as well as mitigations against spyware. Notes 1 Dan Black, “Multiple Russia-Aligned Threat Actors Actively Targeting Signal Messenger,” Google Threat Intelligence (blog), Google, last updated February 19, 2025, https://cloud.google.com/blog/topics/threat-intelligence/russia-targeting-signal-messenger/ . 2 Unit 42, “LANDFALL: New Commercial-Grade Android Spyware in Exploit Chain Targeting Samsung Devices,” Threat Research (blog), Unit 42, Palo Alto Networks, last updated November 7, 2025, https://unit42.paloaltonetworks.com/landfall-is-new-commercial-grade-android-spyware/ ; and Ravie Lakshmanan, “WhatsApp Patches Zero-Click Exploit Targeting iOS and macOS Devices,” The Hacker News,  August 30, 2025, https://thehackernews.com/2025/08/whatsapp-issues-emergency-update-for.html . 3 Vishnu Pratapagiri, “ClayRat: A New Android Spyware Targeting Russia,” Zimperium (blog), Zimperium, October 9, 2025, https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia; Bill Toulas, “Android Spyware Campaigns Impersonate Signal and ToTok Messengers,” Bleeping Computer, October 2, 2025, https://www.bleepingcomputer.com/news/security/android-spyware-campaigns-impersonate-signal-and-totok-messengers/ ; and Pierluigi Paganini, “ClayRat Campaign Uses Telegram and Phishing Sites to Distribute Android Spyware,” Security Affairs, October 9, 2025, https://securityaffairs.com/183169/malware/clayrat-campaign-uses-telegram-and-phishing-sites-to-distribute-android-spyware.html . 4 Courtney Rozen, “WhatsApp Banned on US House of Representatives Devices, Memo Shows,” Reuters, June 23, 2025, https://www.reuters.com/world/us/whatsapp-banned-us-house-representatives-devices-memo-2025-06-23/ ; and Andrew Solender, “WhatsApp Banned on House Staffers' Devices,” Axios, June 23, 2025, https://www.axios.com/2025/06/23/whatsapp-house-congress-staffers-messaging-app . 5 Suzanne Smalley, “Judge Bars NSO from Targeting WhatsApp Users with Spyware, Reduces Damages in Landmark Case.” The Record, October 20, 2025, https://therecord.media/judge-bars-nso-from-targeting-whatsapp-users-lowers-damages . 6 Suzanne Smalley, “Researchers Uncover Spyware Targeting Messaging App Users in the UAE,” The Record, October 2, 2025, https://therecord.media/researchers-spyware-uae-infections . 7 Paganini, “ ClayRat Campaign Uses Telegram and Phishing Sites to Distribute Android Spyware. ”",
    "source": "cisa.gov",
    "time": "2025-11-24T12:00:00",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Bargain hunters urged to stay alert to cyber scams ahead of holiday shopping season",
    "url": "https://www.ncsc.gov.uk/news/stay-alert-to-holiday-shopping-cyber-scams",
    "snippet": "The latest Stop! Think Fraud campaign provides practical advice to help individuals stay secure online",
    "source": "ncsc.gov.uk",
    "time": "2025-11-17T10:08:03",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Groundbreaking cyber advice will help construction firms build strong foundations against online threats",
    "url": "https://www.ncsc.gov.uk/news/groundbreaking-cyber-advice-will-help-construction-firms-build-strong-foundations-against-online-threats",
    "snippet": "New guidance, issued by the NCSC and the Chartered Institute of Building, is designed to help small and medium-sized construction businesses.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-30T13:59:40",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Charities offered latest insight into key cyber threats to help keep out attackers",
    "url": "https://www.ncsc.gov.uk/news/charities-offered-latest-insight-into-key-cyber-threats-to-help-keep-out-attackers",
    "snippet": "Latest report published by the NCSC outlines key threats facing the UK charity sector.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-29T15:25:42",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UK experiencing four 'nationally significant' cyber attacks every week",
    "url": "https://www.ncsc.gov.uk/news/uk-experiencing-four-nationally-significant-cyber-attacks-weekly",
    "snippet": "Latest Annual Review reveals that the cyber threats facing the UK continue to escalate.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-16T13:13:35",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Confirmed compromise of F5 network",
    "url": "https://www.ncsc.gov.uk/news/confirmed-compromise-f5-network",
    "snippet": "The NCSC is advising organisations to follow the guidance issued by F5 and to install the latest security updates.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-15T12:50:18",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Small businesses to receive cyber security boost with new toolkit from experts",
    "url": "https://www.ncsc.gov.uk/news/small-businesses-receive-cyber-security-boost-with-new-toolkit-from-experts",
    "snippet": "NCSC CEO unveils a new Cyber Action Toolkit at the NCSC’s Annual Review launch with clear message to small businesses that ‘it is time to act’.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-13T09:52:09",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Active exploitation of vulnerability affecting Oracle E-Business Suite",
    "url": "https://www.ncsc.gov.uk/news/active-exploitation-vulnerability-affecting-oracle-ebusiness-suite",
    "snippet": "The NCSC is encouraging UK organisations to take immediate action to mitigate a vulnerability (CVE-2025-61882) affecting Oracle E-Business Suite.",
    "source": "ncsc.gov.uk",
    "time": "2025-10-06T09:30:52",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "NCSC statement following reports of nursery data incident",
    "url": "https://www.ncsc.gov.uk/news/nursery-data-incident",
    "snippet": "Statement from the NCSC in response to reports of an incident impacting nurseries.",
    "source": "ncsc.gov.uk",
    "time": "2025-09-25T16:21:30",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "NCSC warns of persistent malware campaign targeting Cisco devices",
    "url": "https://www.ncsc.gov.uk/news/persistent-malicious-targeting-cisco-devices",
    "snippet": "Latest malware analysis report helps organisations detect and mitigate malicious activity targeting certain Cisco devices.",
    "source": "ncsc.gov.uk",
    "time": "2025-09-25T11:55:28",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "NCSC statement: Incident impacting Collins Aerospace",
    "url": "https://www.ncsc.gov.uk/news/collins-aerospace-incident",
    "snippet": "Statement from the NCSC regarding the cyber incident affecting  Collins Aerospace.",
    "source": "ncsc.gov.uk",
    "time": "2025-09-22T08:05:07",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "NCSC statement: Incident impacting Jaguar Land Rover",
    "url": "https://www.ncsc.gov.uk/news/jlr-incident",
    "snippet": "Statement from the NCSC regarding the cyber incident affecting Jaguar Land Rover.",
    "source": "ncsc.gov.uk",
    "time": "2025-09-05T10:32:58",
    "region": "Global",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UK and allies expose China-based technology companies for enabling global cyber campaign against critical networks",
    "url": "https://www.ncsc.gov.uk/news/uk-allies-expose-china-tech-companies-enabling-cyber-campaign",
    "snippet": "The NCSC and international partners share technical details of malicious activities and urge organisations to take mitigative actions.",
    "source": "ncsc.gov.uk",
    "time": "2025-08-27T14:41:48",
    "region": "APJC",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "Active exploitation of vulnerability affecting Microsoft Office SharePoint Server products in the UK",
    "url": "https://www.ncsc.gov.uk/news/active-exploitation-of-vulnerability-affecting-microsoft-office-sharepoint-server-products-in-the-uk",
    "snippet": "The NCSC is encouraging UK organisations to take immediate action to mitigate a vulnerability (CVE-2025-53770) affecting Microsoft SharePoint Server products.",
    "source": "ncsc.gov.uk",
    "time": "2025-07-22T08:44:33",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UK calls out Russian military intelligence for use of espionage tool",
    "url": "https://www.ncsc.gov.uk/news/uk-call-out-russian-military-intelligence-use-espionage-tool",
    "snippet": "Cyber threat group APT 28 has been responsible for deploying a sophisticated malware against user email accounts as part of its operations.",
    "source": "ncsc.gov.uk",
    "time": "2025-07-18T11:19:36",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  },
  {
    "title": "UK and allies expose Russian intelligence campaign targeting western logistics and technology organisations",
    "url": "https://www.ncsc.gov.uk/news/uk-partners-expose-russian-intelligence-campaign",
    "snippet": "Organisations urged to familiarise themselves with the threat and take immediate action to protect themselves.",
    "source": "ncsc.gov.uk",
    "time": "2025-05-22T15:23:34",
    "region": "EMEA",
    "severity": 2,
    "type": "GENERAL"
  }
]