[
  {
    "title": "Is Syria safe to return to?",
    "url": "https://reliefweb.int/report/syrian-arab-republic/syria-safe-return",
    "snippet": "Country: Syrian Arab Republic Source: Action on Armed Violence By Jennifer Dathan on 3 Dec 2025 Since the fall of Assad almost a year ago now, many countries hosting Syrian refugees have pushed for Syrians to return to Syria. Some countries have introduced financial incentives to aid their return, though these incentives often amount to very little when you are returning to a land devastated by conflict for more than a decade. Reports from initial returnees describe the instability and insecurity that come with returning. Some leave again, preferring the life in refugee camps to what Syria can currently offer. A recent report by Synaps , based on 130 interviews with Syrian refugees, returnees and aid sector professionals, detailed the challenges faced by those who have returned including Syria’s ruined economy, destroyed infrastructure, and the absence of jobs or services. The article highlighted the dismal incentives offered by countries hosting refugees to encourage Syrian returnees and the absence of actual support that could enable many to return. Most of these countries have even slashed humanitarian funding supporting Syria and Syrian refugees. But beyond the gutted infrastructure and broken economy, it is worth asking: is Syria safe to return to? Over a decade of conflict has left Syria littered with unexploded ordnance, bombs that have failed to explode from all forces across Syria in the last decade, including by Turkey, Russia, USA, Syria, Israel, and, of course, Britain. There are also improvised explosive devices, left by Islamic State and other non-state actors, that lie in wait in homes and other areas. A whole spectrum of explosive arsenal litters countrysides and cities alike. Considering this, it is no surprise that a week doesn’t go by without a report of a civilian, often a child, killed or maimed by one of these explosive remnants of war. Just last week at least 10 were killed and injured by explosive remnants, including two dead (one man and one child) and eight injured (one woman and seven children). Areas impacted include Aleppo, Daraa, Damascus, Deir Ezzor, Idlib. Date Incident Source Monday November 24th 2025 Woman and daughter injured by ERW exploded in stove in Bidama, Idlib https://npasyria.com/en/132489/ Monday November 24th 2025 Child grazing sheep severely injured by landmine explosion in Ghariba, Deir Ezzor https://npasyria.com/en/132489/ Monday November 24th 2025 Five children injured by explosion of war remnant in al-Danaji village, Damascus https://npasyria.com/en/132489/ Wednesday November 26th 2025 Tractor driver fatally injured by landmine explosion while farming in Al-Mazra’a village, Aleppo https://www.syriahr.com/en/374055/ Friday November 28th 2025 Child killed in explosion of old grenade in Kafr Nasej village, Daraa https://www.syriahr.com/en/374162/ Other violent incidents across the country last week included 15 killed and 20 injured in Rif Dimashq by Israeli bombardment; a civilian killed by a Syrian armed drone in al-Suweida; a man shot by gunmen on a motorcycle in Homs; and five killed and nine injured in explosion at weapons warehouse belonging to Turkistan Islamic Party in Kafr Takharim, Idlib. In the first 10 months of this year at least 1,327 civilians have been killed and injured by unexploded ordnance across Syria, according to AOAV’s figures – over 130 a month on average. With this in mind, last week’s 10 casualties actually made for a comparatively quiet week. It is also worth reflecting that in the same period last year (Jan 2024 – Oct 2024), AOAV recorded 271 civilian casualties from UXO. While we cannot be sure, it seems likely that this 390% increase in civilian harm between these periods may reflect to some degree a rise in Syrians returning to homes across the country since the fall of Assad last December. On top of UXO casualties, violence still continues across the country, with 910 civilian deaths and injuries from explosive violence so far this year (to the end of October). These include 389 from air-launched explosives, 264 from ground-launched explosives, 234 from IEDs and landmines, and 23 from un unclear launch method. In a 2025 Humanity and Inclusion report, it was estimated that there are between 100,000 and 300,000 explosive items littering the country , and two-thirds of the population at immediate risk of death or injury due to the UXO. So, one year after Assad’s fall, Syria’s landscape is still defined by shattered infrastructure, urgent humanitarian need, and unexploded ordnance threatening daily life. Before urging returnees, host states – particularly in the West – must invest in rebuilding the conditions that make return possible. When those foundations are laid, it is likely many Syrians will wish to return.",
    "source": "reliefweb.int",
    "time": "2025-12-04T03:14:24",
    "region": "AMER",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "World: WHO launches new, unified plan for countries to manage coronaviruses: COVID-19 and beyond",
    "url": "https://reliefweb.int/report/world/who-launches-new-unified-plan-countries-manage-coronaviruses-covid-19-and-beyond",
    "snippet": "Country: World Source: World Health Organization The World Health Organization (WHO) has released a new strategic plan for the management of coronavirus disease threats, including COVID-19, Middle East respiratory syndrome (MERS), and potential new coronavirus diseases. This is the first such unified plan for coronavirus disease threats, marking a turning point in the transition from the COVID-19 emergency response to sustained, long-term, and integrated management. Building on the lessons of the past five years of COVID-19 response and ongoing work on MERS and other respiratory diseases, the Strategic plan for coronavirus disease threat management: advancing integration, sustainability, and equity, 2025–2030 guides national health authorities and partners in taking a coherent, action-oriented approach to managing coronavirus disease threats in the broader context of infectious disease management. From the emergence and spread of the first SARS coronavirus in 2002 and MERS-CoV in 2012, to SARS-CoV-2, the virus that causes COVID-19, in 2019, coronaviruses have repeatedly shown their capacity to trigger epidemics and pandemics. Although the global impact of COVID-19 has reduced since the peak of the pandemic, the virus continues to circulate widely, causing severe disease and death in high-risk groups. Around 6% of those infected develop Post COVID-19 Condition (also known as long COVID), with 15% of these people experiencing symptoms beyond a year. Several regions have recently reported increases in SARS-CoV-2 activity, and uncertainties persist around virus evolution and long-term impacts of COVID-19. “Coronaviruses remain one of the most consequential infectious disease threats today,” said Dr Maria Van Kerkhove, WHO Acting Director for Epidemic and Pandemic Management. “Integrating their management into broader respiratory disease and infectious threat prevention and control programmes, including for influenza, is essential. While each country will have its own approach tailored to its national context, WHO urges Member States to use the strategic directions set out in the plan to build resilient health systems that can effectively manage current threats while preparing for future ones.” The strategic plan builds on previous Strategic Preparedness and Response Plans for COVID-19 and reflects a consultative and inclusive process, drawing on input from WHO Member States, regional and country offices, technical partners, and the general public to ensure that the strategic plan is grounded in the diverse needs, priorities, and realities of health systems and communities worldwide. The plan encompasses both routine management as well as emergency scenarios, reflecting the flexibility national systems need to deal with known circulating coronaviruses and the emergence of a new coronavirus with pandemic potential. To strengthen global coronavirus monitoring, WHO has also expanded its Coronavirus Network (CoViNet), a network of disease surveillance programmes and reference laboratories for SARS-CoV-2, MERS-CoV, and emerging coronaviruses of public health significance. CoViNet now includes 45 national reference laboratories across the human, animal, and environmental health sectors, with 11 laboratories added in 2025. CoViNet complements WHO’s Global Influenza Surveillance and Response System (GISRS), which conducts global sentinel surveillance, including for SARS-CoV-2.",
    "source": "reliefweb.int",
    "time": "2025-12-04T03:05:08",
    "region": "Global",
    "severity": 2,
    "type": "HEALTH / SAFETY"
  },
  {
    "title": "Sri Lanka: Australia commits over $14 million to support Indo-Pacific disaster response",
    "url": "https://reliefweb.int/report/sri-lanka/australia-commits-over-14-million-support-indo-pacific-disaster-response",
    "snippet": "Countries: Sri Lanka, Australia, Indonesia, Malaysia, Thailand, Viet Nam Source: Government of Australia Joint media release with: The Hon Anne Aly MP, Minister for International Development 04 December 2025 The Albanese Government is providing an additional $5 million in emergency assistance in response to the worsening impacts of recent cyclones and flooding in the Indo-Pacific region. This brings Australia's total assistance to over $14 million since October, supporting local and international partners to provide urgent lifesaving assistance to affected communities. Today's announcement includes an additional $2.5 million for Sri Lanka, increasing Australia's response to the impacts of Cyclone Ditwah to $3.5 million. Australia is engaging with all affected countries, with support to be provided through Australian NGOs and the United Nations as requested to meet urgent needs. In recent weeks, Australia's close partners in our region have experienced the devastating impacts of cyclones, floods, earthquakes and landslides. Communities in Indonesia, Malaysia, Philippines, Sri Lanka, Thailand and Vietnam have all been affected. Australia's support is providing emergency relief supplies, shelter, food, water and sanitation, and it is meeting the needs of displaced communities, including support for health and education. Our funding prioritises the needs of the most vulnerable, including women, girls and people with disability. Australia will continue to work with countries and communities in the region as a steadfast and reliable partner across the Indo-Pacific. Quotes attributable to Minister for Foreign Affairs Penny Wong: \"Our thoughts are with all those affected by the recent floods and devastation in Southeast Asia and Sri Lanka. We are working with our partners in the region to deliver life-saving assistance to accelerate their response. \"Australia is committed to supporting our neighbours in good times and bad – we are a partner our region can count on.\" Quotes attributable to Minister for International Development Dr Anne Aly: \"Recent severe weather and earthquakes have had devastating impacts for communities in our region, and we're ensuring our neighbours have the support they need to help communities to respond. \"Already vulnerable community groups - such as women and girls and people with disability - are regularly the worst impacted when disaster strikes. We're working with trusted and experienced partners to ensure assistance is getting to the people who need it.\" Media enquiries Minister's office: (02) 6277 7500 DFAT Media Liaison: (02) 6261 1555",
    "source": "reliefweb.int",
    "time": "2025-12-04T02:14:25",
    "region": "APJC",
    "severity": 2,
    "type": "CRISIS / WEATHER"
  },
  {
    "title": "Marquis data breach impacts over 74 US banks, credit unions",
    "url": "https://www.bleepingcomputer.com/news/security/marquis-data-breach-impacts-over-74-us-banks-credit-unions/",
    "snippet": "Financial software provider Marquis Software Solutions is warning that it suffered a data breach that impacted dozens of banks and credit unions across the US. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T22:06:07",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Critical flaw in WordPress add-on for Elementor exploited in attacks",
    "url": "https://www.bleepingcomputer.com/news/security/critical-flaw-in-wordpress-add-on-for-elementor-exploited-in-attacks/",
    "snippet": "Attackers are exploiting a critical-severity privilege escalation vulnerability (CVE-2025-8489) in the King Addons for Elementor plugin for WordPress, which lets them obtain administrative permissions during the registration process. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T21:31:20",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "French DIY retail giant Leroy Merlin discloses a data breach",
    "url": "https://www.bleepingcomputer.com/news/security/french-diy-retail-giant-leroy-merlin-discloses-a-data-breach/",
    "snippet": "Leroy Merlin is sending security breach notifications to customers in France, informing them that their personal data was compromised. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T20:52:36",
    "region": "EMEA",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Freedom Mobile discloses data breach exposing customer data",
    "url": "https://www.bleepingcomputer.com/news/security/freedom-mobile-discloses-data-breach-exposing-customer-data/",
    "snippet": "Freedom Mobile, the fourth-largest wireless carrier in Canada, has disclosed a data breach after attackers hacked into its customer account management platform and stole the personal information of an undisclosed number of customers. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T20:28:01",
    "region": "AMER",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Family of man slain in a US boat strike in the Caribbean lodges complaint",
    "url": "https://www.aljazeera.com/news/2025/12/3/family-of-man-slain-in-a-us-boat-strike-in-the-caribbean-lodges-complaint?traffic_source=rss",
    "snippet": "Family of Colombian fisherman Alejandro Carranza say his right to life was violated in US 'narco-terrorist' strikes.",
    "source": "aljazeera.com",
    "time": "2025-12-03T20:09:24",
    "region": "Global",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Microsoft \"mitigates\" Windows LNK flaw exploited as zero-day",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-mitigates-windows-lnk-flaw-exploited-as-zero-day/",
    "snippet": "Microsoft has silently \"mitigated\" a high-severity Windows LNK vulnerability exploited by multiple state-backed and cybercrime hacking groups in zero-day attacks. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T16:45:30",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Israel receives coffin that Palestinian groups say contains Gaza hostage's body",
    "url": "https://www.bbc.com/news/articles/cd6x2j4g3z7o?at_medium=RSS&at_campaign=rss",
    "snippet": "The remains, which Hamas and Palestinian Islamic Jihad say were found in northern Gaza, will be taken to Tel Aviv for forensic tests.",
    "source": "bbc.com",
    "time": "2025-12-03T16:43:34",
    "region": "Global",
    "severity": 2,
    "type": "PHYSICAL SECURITY"
  },
  {
    "title": "Deep dive into DragonForce ransomware and its Scattered Spider connection",
    "url": "https://www.bleepingcomputer.com/news/security/deep-dive-into-dragonforce-ransomware-and-its-scattered-spider-connection/",
    "snippet": "DragonForce expanded its ransomware operation in 2025 by working with English-speaking hackers known for advanced social engineering and initial access. Acronis explains how the \"Scattered Spider\" collaboration enables coordinated, multistage intrusions across major environments. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T15:05:15",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Aisuru botnet behind new record-breaking 29.7 Tbps DDoS attack",
    "url": "https://www.bleepingcomputer.com/news/security/aisuru-botnet-behind-new-record-breaking-297-tbps-ddos-attack/",
    "snippet": "In just three months, the massive Aisuru botnet launched more than 1,300 distributed denial-of-service attacks, one of them setting a new record with a peak at 29.7 terabits per second. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T14:01:04",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Production halted at Chinese factory making 'childlike' sex dolls",
    "url": "https://www.bbc.com/news/articles/ckgzqxjzjyqo?at_medium=RSS&at_campaign=rss",
    "snippet": "The issue is in the spotlight after Shein announced a global ban on the sale of sex dolls with a childlike appearance.",
    "source": "bbc.com",
    "time": "2025-12-03T13:46:49",
    "region": "Global",
    "severity": 2,
    "type": "SUPPLY CHAIN"
  },
  {
    "title": "University of Phoenix discloses data breach after Oracle hack",
    "url": "https://www.bleepingcomputer.com/news/security/university-of-phoenix-discloses-data-breach-after-oracle-hack/",
    "snippet": "The University of Phoenix (UoPX) has joined a growing list of U.S. universities breached in a Clop data theft campaign targeting vulnerable Oracle E-Business Suite instances in August 2025. [...]",
    "source": "bleepingcomputer.com",
    "time": "2025-12-03T13:23:10",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA, Australia, and Partners Author Joint Guidance on Securely Integrating Artificial Intelligence in Operational Technology",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/03/cisa-australia-and-partners-author-joint-guidance-securely-integrating-artificial-intelligence",
    "snippet": "CISA and the Australian Signals Directorate’s Australian Cyber Security Centre, in collaboration with federal and international partners, have released new cybersecurity guidance: Principles for the Secure Integration of Artificial Intelligence in Operational Technology . This guidance aims to help critical infrastructure owners and operators integrate artificial intelligence (AI) into operational technology (OT) systems securely, balancing the benefits of AI—such as increased efficiency, enhanced decision-making, and cost savings—with the unique risks it poses to the safety, security, and reliability of OT environments. The document focuses on machine learning (ML), large language models (LLMs), and AI agents due to their complex security challenges, but is also applicable to systems using traditional statistical modeling and logic-based automation. Key Principles for Secure AI Integration: Understand AI: Educate personnel on AI risks, impacts, and secure development lifecycles. Assess AI Use in OT: Evaluate business cases, manage OT data security risks, and address immediate and long-term integration challenges. Establish AI Governance: Implement governance frameworks, test AI models continuously, and ensure regulatory compliance. Embed Safety and Security: Maintain oversight, ensure transparency, and integrate AI into incident response plans. Critical infrastructure owners and operators are encouraged to adopt these principles to maximize AI benefits while mitigating risks. For further details, review the full guidance . For more information on related resources, visit CISA’s Artificial Intelligence and Industrial Control Systems webpages.",
    "source": "cisa.gov",
    "time": "2025-12-03T12:00:00",
    "region": "APJC",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Adds One Known Exploited Vulnerability to Catalog",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/03/cisa-adds-one-known-exploited-vulnerability-catalog",
    "snippet": "CISA has added one new vulnerability to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2021-26828 OpenPLC ScadaBR Unrestricted Upload of File with Dangerous Type Vulnerability This type of vulnerability is a frequent attack vector for malicious cyber actors and poses significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of known Common Vulnerabilities and Exposures (CVEs) that carry significant risk to the federal enterprise. BOD 22-01 requires Federal Civilian Executive Branch (FCEB) agencies to remediate identified vulnerabilities by the due date to protect FCEB networks against active threats. See the BOD 22-01 Fact Sheet for more information. Although BOD 22-01 only applies to FCEB agencies, CISA strongly urges all organizations to reduce their exposure to cyberattacks by prioritizing timely remediation of KEV Catalog vulnerabilities as part of their vulnerability management practice. CISA will continue to add vulnerabilities to the catalog that meet the specified criteria .",
    "source": "cisa.gov",
    "time": "2025-12-03T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Iskra iHUB and iHUB Lite",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Iskra Equipment : iHUB and iHUB Lite Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could allow a remote attacker to reconfigure devices, update firmware, and manipulate connected systems without any credentials. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Iskra iHUB and iHUB Lite, a Smart Metering Gateway and Data Concentrator, are affected: iHUB and iHUB Lite: All Versions 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 The Iskra iHUB and iHUB Lite smart metering gateway exposes its web management interface without requiring authentication, allowing unauthenticated users to access and modify critical device settings. CVE-2025-13510 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:N ). A CVSS v4 score has also been calculated for CVE-2025-13510 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:N/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Slovenia 3.4 RESEARCHER Souvik Kandar reported this vulnerability to CISA. 4. MITIGATIONS Iskra did not respond to CISA's request for coordination. Contact Iskra using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Mirion Medical EC2 Software NMIS BioDose",
    "url": "https://www.cisa.gov/news-events/ics-medical-advisories/icsma-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.7 ATTENTION : Exploitable remotely/low attack complexity Vendor : Mirion Medical Equipment : EC2 Software NMIS BioDose Vulnerabilities : Incorrect Permission Assignment for Critical Resource, Use of Client-Side Authentication, Use of Hard-coded Credentials 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to modify program executables, gain access to sensitive information, gain unauthorized access to the application, and execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Mirion Medical products are affected: EC2 Software NMIS BioDose: Versions prior to 23.0 3.2 VULNERABILITY OVERVIEW 3.2.1 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions' installation directory paths by default have insecure file permissions, which in certain deployment scenarios can enable users on client workstations to modify the program executables and libraries. CVE-2025-64642 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.0 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:L/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64642 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:L/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous version installations where the embedded Microsoft SQLServer Express is used are exposed in the Windows share accessed by clients in networked installs. By default, this directory has insecure directory paths that allow access to the SQL Server database and configuration files, which can contain sensitive data. CVE-2025-64298 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64298 . A base score of 8.6 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.3 USE OF CLIENT-SIDE AUTHENTICATION CWE-603 NMIS/BioDose V22.02 and previous versions rely on a common SQL Server user account to access data in the database. User access in the client application is restricted by a password authentication check in the client software but the underlying database connection always has access. The latest version of NMIS/BioDose introduces an option to use Windows user authentication with the database, which would restrict this database connection. CVE-2025-61940 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-61940 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.4 USE OF HARD-CODED CREDENTIALS CWE-798 NMIS/BioDose software V22.02 and previous versions contain executable binaries with plain text hard-coded passwords. These hard-coded passwords could allow unauthorized access to both the application and database. CVE-2025-64778 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.3 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-64778 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.2.5 INCORRECT PERMISSION ASSIGNMENT FOR CRITICAL RESOURCE CWE-732 NMIS/BioDose V22.02 and previous versions rely on a Microsoft SQL Server database. The SQL user account 'nmdbuser' and other created accounts by default have the sysadmin role. This can lead to remote code execution through the use of certain built-in stored procedures. CVE-2025-62575 has been assigned to this vulnerability. A CVSS v3.1 base score of 8.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-62575 . A base score of 8.7 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:L/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Healthcare and Public Health COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Joe Dillon reported these vulnerabilities to Mirion Medical. 4. MITIGATIONS Mirion Medical recommends users update to V23.0 or later. Users with an active support contract should update to the latest version through the software or users can contact Mirion Medical support directly. CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Releases Five Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-releases-five-industrial-control-systems-advisories",
    "snippet": "CISA released five Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-336-01 Industrial Video & Control Longwatch ICSA-25-336-02 Iskra iHUB and iHUB Lite ICSMA-25-336-01 Mirion Medical EC2 Software NMIS BioDose ICSA-25-201-01 Mitsubishi Electric CNC Series (Update A) ICSA-23-157-02 Mitsubishi Electric MELSEC iQ-R Series/iQ-F Series (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Adds Two Known Exploited Vulnerabilities to Catalog",
    "url": "https://www.cisa.gov/news-events/alerts/2025/12/02/cisa-adds-two-known-exploited-vulnerabilities-catalog",
    "snippet": "CISA has added two new vulnerabilities to its Known Exploited Vulnerabilities (KEV) Catalog , based on evidence of active exploitation. CVE-2025-48572 Android Framework Privilege Escalation Vulnerability CVE-2025-48633 Android Framework Information Disclosure Vulnerability These types of vulnerabilities are a frequent attack vector for malicious cyber actors and pose significant risks to the federal enterprise. Binding Operational Directive (BOD) 22-01: Reducing the Significant Risk of Known Exploited Vulnerabilities established the KEV Catalog as a living list of known Common Vulnerabilities and Exposures (CVEs) that carry significant risk to the federal enterprise. BOD 22-01 requires Federal Civilian Executive Branch (FCEB) agencies to remediate identified vulnerabilities by the due date to protect FCEB networks against active threats. See the BOD 22-01 Fact Sheet for more information. Although BOD 22-01 only applies to FCEB agencies, CISA strongly urges all organizations to reduce their exposure to cyberattacks by prioritizing timely remediation of KEV Catalog vulnerabilities as part of their vulnerability management practice. CISA will continue to add vulnerabilities to the catalog that meet the specified criteria .",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Industrial Video & Control Longwatch",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-336-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Industrial Video & Control Equipment : Longwatch Vulnerability : IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') 2. RISK EVALUATION Successful exploitation of this vulnerability could allow an unauthenticated attacker to gain remote code execution with elevated privileges. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of Industrial Video & Control Longwatch, a video surveillance and monitoring system, are affected: Longwatch: Versions 6.309 to 6.334 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER CONTROL OF GENERATION OF CODE ('CODE INJECTION') CWE-94 A vulnerability in Longwatch devices allows unauthenticated HTTP GET requests to execute arbitrary code via an exposed endpoint, due to the absence of code signing and execution controls. Exploitation results in SYSTEM-level privileges. CVE-2025-13658 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13658 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Energy, Water and Wastewater Systems COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Concerned OT Engineer reported this vulnerability to CISA. 4. MITIGATIONS Industrial Video & Control recommends users running versions 6.309 to 6.334 should upgrade to version 6.335 or later to ensure protection against this vulnerability. For more details, view Industrial Video & Control's advisory . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY December 2, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-12-02T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "CISA Releases Seven Industrial Control Systems Advisories",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/25/cisa-releases-seven-industrial-control-systems-advisories",
    "snippet": "CISA released seven Industrial Control Systems (ICS) Advisories. These advisories provide timely information about current security issues, vulnerabilities, and exploits surrounding ICS. ICSA-25-329-01 Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, Cobalt Share ICSA-25-329-02 Rockwell Automation Arena Simulation ICSA-25-329-03 Zenitel TCIV-3+ ICSA-25-329-04 Opto 22 groov View ICSA-25-329-05 Festo Compact Vision System, Control Block, Controller, and Operator Unit products ICSA-25-329-06 SiRcom SMART Alert (SiSA) ICSA-22-333-05 Mitsubishi Electric FA Engineering Software (Update C) CISA encourages users and administrators to review newly released ICS Advisories for technical details and mitigations.",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "SiRcom SMART Alert (SiSA)",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-06",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.8 ATTENTION : Exploitable remotely/low attack complexity Vendor : SiRcom Equipment : SMART Alert (SiSA) Vulnerability : Missing Authentication for Critical Function 2. RISK EVALUATION Successful exploitation of this vulnerability could enable an attacker to remotely activate or manipulate emergency sirens. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of SiRcom SMART Alert (SiSA), a central control system, are affected: SMART Alert (SiSA): Version 3.0.48 3.2 VULNERABILITY OVERVIEW 3.2.1 Missing Authentication for Critical Function CWE-306 SiRcom SMART Alert (SiSA) allows unauthorized access to backend APIs. This allows an unauthenticated attacker to bypass the login screen using browser developer tools, gaining access to restricted parts of the application. CVE-2025-13483 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:N/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-13483 . A base score of 8.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:N/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Emergency Services, Government Services and Facilities, Defense Industrial Base COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Souvik Kandar of Microsec (microsec.io) reported this vulnerability to CISA. 4. MITIGATIONS SiRcom did not respond to CISA's request for coordination. Contact SiRcom using their contact page for more information. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Opto 22 groov View",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-04",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 6.1 ATTENTION : Exploitable remotely/Low attack complexity Vendor : Opto 22 Equipment : groov View Vulnerability : Exposure of Sensitive Information Through Metadata 2. RISK EVALUATION Successful exploitation of this vulnerability could result in credential exposure, key exposure, and privilege escalation. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of groov View are affected: groov View Server for Windows: Versions R1.0a to R4.5d GRV-EPIC-PR1 Firmware: Versions prior to 4.0.3 GRV-EPIC-PR2 Firmware: Versions prior to 4.0.3 3.2 VULNERABILITY OVERVIEW 3.2.1 Exposure of Sensitive Information Through Metadata CWE-1230 The users endpoint in the groov View API returns a list of all users and associated metadata including their API keys. This endpoint requires an Editor role to access and will display API keys for all users, including Administrators. CVE-2025-13084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:L/UI:N/S:U/C:H/I:L/A:L ). A CVSS v4 score has also been calculated for CVE-2025-13084 . A base score of 6.1 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:P/PR:L/UI:N/VC:H/VI:L/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Nik Tsytsarkin, Ismail Aydemir, and Ryan Hall of Meta reported this vulnerability to CISA. 4. MITIGATIONS Opto 22 has published a patch to address this vulnerability and recommends that users upgrade to groov View Server for Windows Version R4.5e and GRV-EPIC Firmware Version 4.0.3. Additional information is available from Opto 22 here . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, Cobalt Share",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.4 ATTENTION : Low attack complexity Vendor : Ashlar-Vellum Equipment : Cobalt, Xenon, Argon, Lithium, Cobalt Share Vulnerabilities : Out-of-Bounds Write, Heap-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow an attacker to disclose information or execute arbitrary code. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Ashlar-Vellum products are affected: Cobalt: Versions 12.6.1204.207 and prior Xenon: Versions 12.6.1204.207 and prior Argon: Versions 12.6.1204.207 and prior Lithium: Versions 12.6.1204.207 and prior Cobalt Share: Versions 12.6.1204.207 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 OUT-OF-BOUNDS WRITE CWE-787 An Out-of-Bounds Write vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65084 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65084 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.2.2 HEAP-BASED BUFFER OVERFLOW CWE-122 A Heap-based Buffer Overflow vulnerability is present in Ashlar-Vellum Cobalt, Xenon, Argon, Lithium, and Cobalt Share versions 12.6.1204.207 and prior that could allow an attacker to disclose information or execute arbitrary code. CVE-2025-65085 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.8 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-65085 . A base score of 8.4 has been calculated; the CVSS vector string is ( AV:L/AC:L/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported these vulnerabilities to CISA. 4. MITIGATIONS Ashlar-Vellum recommends users update to the following versions: Cobalt: Versions 12.6.1204.208 or higher Xenon: Versions 12.6.1204.208 or higher Argon: Versions 12.6.1204.208 or higher Lithium: Versions 12.6.1204.208 or higher Cobalt Share: Versions 12.6.1204.208 or higher CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. These vulnerabilities are not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Zenitel TCIV-3+",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-03",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 10.0 ATTENTION: Exploitable remotely/low attack complexity Vendor: Zenitel Equipment: TCIV-3+ Vulnerabilities: OS Command Injection, Out-of-bounds Write, Cross-site Scripting 2. RISK EVALUATION Successful exploitation of these vulnerabilities could result in arbitrary code execution or cause a denial-of-service condition. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of TCIV-3+ are affected: TCIV-3+: All versions prior to 9.3.3.0 3.2 VULNERABILITY OVERVIEW 3.2.1 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to improper input validation. The application accepts a parameter directly from user input without verifying it is a valid IP address or filtering potentially malicious characters. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64126 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64126 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.2 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to insufficient sanitization of user-supplied input. The application accepts parameters that are later incorporated into OS commands without adequate validation. This could allow an unauthenticated attacker to execute arbitrary commands remotely. CVE-2025-64127 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64127 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.3 IMPROPER NEUTRALIZATION OF SPECIAL ELEMENTS USED IN AN OS COMMAND ('OS COMMAND INJECTION') CWE-78 An OS command injection vulnerability exists due to incomplete validation of user-supplied input. Validation fails to enforce sufficient formatting rules, which could permit attackers to append arbitrary data. This could allow an unauthenticated attacker to inject arbitrary commands. CVE-2025-64128 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64128 . A base score of 10.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:H/SI:L/SA:H ). 3.2.4 OUT-OF-BOUNDS WRITE CWE-787 The affected product is vulnerable to an out-of-bounds write vulnerability, which could allow a remote attacker to crash the device. CVE-2025-64129 has been assigned to this vulnerability. A CVSS v3 base score of 7.6 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:R/S:U/C:L/I:L/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64129 . A base score of 7.0 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:A/VC:L/VI:L/VA:H/SC:N/SI:N/SA:N ). 3.2.5 IMPROPER NEUTRALIZATION OF INPUT DURING WEB PAGE GENERATION ('CROSS-SITE SCRIPTING') CWE-79 The affected product is vulnerable to a reflected cross-site scripting vulnerability, which could allow a remote attacker to execute arbitrary JavaScript on the victim's browser. CVE-2025-64130 has been assigned to this vulnerability. A CVSS v3 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-64130 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Communications COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: Belgium 3.4 RESEARCHER Nir Tepper and Noam Moshe of Claroty Team82 reported these vulnerabilities to CISA. 4. MITIGATIONS Zenitel recommends users to upgrade to Version 9.3.3.0 or later . CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. 5. UPDATE HISTORY November 25, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Rockwell Automation Arena Simulation",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-329-02",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.1 ATTENTION : Exploitable from a local network Vendor : Rockwell Automation Equipment : Arena Simulation Vulnerability : Stack-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of this vulnerability could allow local attackers to execute arbitrary code on affected installations of Arena. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Rockwell Automation products are affected: Arena Simulation: Version 16.20.10 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121 Arena suffers from a stack-based buffer overflow vulnerability. The specific flaw exists within the parsing of DOE files. Local attackers are able to exploit this issue to potentially execute arbitrary code on affected installations of Arena. Exploiting the vulnerability requires opening a malicious DOE file. CVE-2025-11918 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.0 has been calculated; the CVSS vector string is ( AV:L/AC:H/PR:N/UI:R/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2025-11918 . A base score of 7.1 has been calculated; the CVSS vector string is ( AV:L/AC:H/AT:N/PR:N/UI:A/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Michael Heinzl reported this vulnerability to CISA. 4. MITIGATIONS Rockwell Automation recommends users upgrade Arena Simulation to version 16.20.11 or later . Users who are unable to upgrade the affected software to a correct version should use Rockwell Automation's security best practices . For more information about this issue, see advisory SD1763 on the Rockwell Automation security page. CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 25, 2025: Initial publication",
    "source": "cisa.gov",
    "time": "2025-11-25T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "​​Spyware Allows Cyber Threat Actors to Target Users of Messaging Applications​",
    "url": "https://www.cisa.gov/news-events/alerts/2025/11/24/spyware-allows-cyber-threat-actors-target-users-messaging-applications",
    "snippet": "CISA is aware of multiple cyber threat actors actively leveraging commercial spyware to target users of mobile messaging applications (apps). 1 These cyber actors use sophisticated targeting and social engineering techniques to deliver spyware and gain unauthorized access to a victim’s messaging app, facilitating the deployment of additional malicious payloads that can further compromise the victim’s mobile device. These cyber actors use tactics such as: Phishing and malicious device-linking QR codes to compromise victim accounts and link them to actor-controlled devices. Zero-click exploits, 2 which require no direct action from the device user. Impersonation 3 of messaging app platforms, such as Signal and WhatsApp. While current targeting remains opportunistic, evidence suggests these cyber actors focus on high-value individuals, such as current and former high-ranking government, military, and political officials, 4 as well as civil society organizations (CSOs) and individuals across the United States, 5 Middle East, 6 and Europe. 7 CISA strongly encourages messaging app users to review the updated Mobile Communications Best Practice Guidance and Mitigating Cyber Threats with Limited Resources: Guidance for Civil Society for steps to protect mobile communications and messaging apps, as well as mitigations against spyware. Notes 1 Dan Black, “Multiple Russia-Aligned Threat Actors Actively Targeting Signal Messenger,” Google Threat Intelligence (blog), Google, last updated February 19, 2025, https://cloud.google.com/blog/topics/threat-intelligence/russia-targeting-signal-messenger/ . 2 Unit 42, “LANDFALL: New Commercial-Grade Android Spyware in Exploit Chain Targeting Samsung Devices,” Threat Research (blog), Unit 42, Palo Alto Networks, last updated November 7, 2025, https://unit42.paloaltonetworks.com/landfall-is-new-commercial-grade-android-spyware/ ; and Ravie Lakshmanan, “WhatsApp Patches Zero-Click Exploit Targeting iOS and macOS Devices,” The Hacker News,  August 30, 2025, https://thehackernews.com/2025/08/whatsapp-issues-emergency-update-for.html . 3 Vishnu Pratapagiri, “ClayRat: A New Android Spyware Targeting Russia,” Zimperium (blog), Zimperium, October 9, 2025, https://zimperium.com/blog/clayrat-a-new-android-spyware-targeting-russia; Bill Toulas, “Android Spyware Campaigns Impersonate Signal and ToTok Messengers,” Bleeping Computer, October 2, 2025, https://www.bleepingcomputer.com/news/security/android-spyware-campaigns-impersonate-signal-and-totok-messengers/ ; and Pierluigi Paganini, “ClayRat Campaign Uses Telegram and Phishing Sites to Distribute Android Spyware,” Security Affairs, October 9, 2025, https://securityaffairs.com/183169/malware/clayrat-campaign-uses-telegram-and-phishing-sites-to-distribute-android-spyware.html . 4 Courtney Rozen, “WhatsApp Banned on US House of Representatives Devices, Memo Shows,” Reuters, June 23, 2025, https://www.reuters.com/world/us/whatsapp-banned-us-house-representatives-devices-memo-2025-06-23/ ; and Andrew Solender, “WhatsApp Banned on House Staffers' Devices,” Axios, June 23, 2025, https://www.axios.com/2025/06/23/whatsapp-house-congress-staffers-messaging-app . 5 Suzanne Smalley, “Judge Bars NSO from Targeting WhatsApp Users with Spyware, Reduces Damages in Landmark Case.” The Record, October 20, 2025, https://therecord.media/judge-bars-nso-from-targeting-whatsapp-users-lowers-damages . 6 Suzanne Smalley, “Researchers Uncover Spyware Targeting Messaging App Users in the UAE,” The Record, October 2, 2025, https://therecord.media/researchers-spyware-uae-infections . 7 Paganini, “ ClayRat Campaign Uses Telegram and Phishing Sites to Distribute Android Spyware. ”",
    "source": "cisa.gov",
    "time": "2025-11-24T12:00:00",
    "region": "EMEA",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Emerson Appleton UPSMON-PRO",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-06",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 9.3 ATTENTION : Exploitable remotely/low attack complexity Vendor : Emerson Equipment : Appleton UPSMON-PRO Vulnerability : Stack-based Buffer Overflow 2. RISK EVALUATION Successful exploitation of this vulnerability could allow remote attackers to execute arbitrary code on affected installations of Appleton UPSMON-PRO. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Emerson products are affected: Appleton UPSMON-PRO: Versions 2.6 and prior 3.2 VULNERABILITY OVERVIEW 3.2.1 STACK-BASED BUFFER OVERFLOW CWE-121 A crafted UDP packet sent to the default UDP port 2601 can cause an overflow of the buffer stack, overwriting critical memory locations. This could allow unauthorized individuals to execute arbitrary code with SYSTEM privileges if the UPSMONProService service communication is not properly validated. CVE-2024-3871 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.8 has been calculated; the CVSS vector string is ( AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2024-3871 . A base score of 9.3 has been calculated; the CVSS vector string is ( AV:N/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing, Healthcare and Public Health COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER kimiya working with Trend Micro's Zero Day Initiative reported this vulnerability to CISA. 4. MITIGATIONS According to Emerson, Appleton UPSMON-PRO is End of Life and unsupported. Any users still using the product are recommended to replace the product or apply the following mitigations based on your company policies and Cybersecurity Operational recommendations. Recommended Actions if not replaced: Block UDP port 2601 at firewall level for all UPSMON-PRO installations Isolate UPS monitoring networks from general corporate networks Implement network-level packet filtering to reject oversized UDP packets to port 2601 Monitor for UPSMONProSer.exe service crashes as potential indicators of exploitation attempts Long-term Strategy Recommendation: Replace UPSMON-PRO with actively supported UPS monitoring solution Implement defense-in-depth strategies for critical power infrastructure monitoring CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Opto 22 GRV-EPIC and groov RIO",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-03",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 7.5 ATTENTION : Exploitable remotely Vendor : Opto 22 Equipment : GRV-EPIC-PR1, GRV-EPIC-PR2, groov RIO Vulnerability : Improper Neutralization of Special Elements used in an OS Command 2. RISK EVALUATION Successful exploitation of this vulnerability could result in the execution of arbitrary shell commands with root privileges. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following versions of GRV Programmable Logic Controllers are affected: GRV-EPIC-PR1 Firmware: Versions prior to 4.0.3 GRV-EPIC-PR2 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-MM1001-10 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-MM2001-10 Firmware: Versions prior to 4.0.3 groov RIO GRV-R7-I1VAPM-3 Firmware: Versions prior to 4.0.3 3.2 VULNERABILITY OVERVIEW 3.2.1 Improper Neutralization of Special Elements used in an OS Command ('OS Command Injection') CWE-78 A vulnerability exists in the Opto22 Groov Manage REST API on GRV-EPIC and groov RIO Products that allows remote code execution with root privileges. When a POST request is executed against the vulnerable endpoint, the application reads certain header details and unsafely uses these values to build commands, allowing an attacker with administrative privileges to inject arbitrary commands that execute as root. CVE-2025-13087 has been assigned to this vulnerability. A CVSS v3.1 base score of 6.2 has been calculated; the CVSS vector string is ( AV:N/AC:H/PR:H/UI:N/S:U/C:H/I:H/A:L ). A CVSS v4 score has also been calculated for CVE-2025-13087 . A base score of 7.5 has been calculated; the CVSS vector string is ( AV:N/AC:H/AT:N/PR:H/UI:N/VC:H/VI:H/VA:L/SC:N/SI:N/SA:N ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Nik Tsytsarkin, Ismail Aydemir, and Ryan Hall of Meta reported this vulnerability to CISA. 4. MITIGATIONS Opto 22 has published a patch to address this vulnerability and recommends that users upgrade to GRV-EPIC and groov RIO Firmware Version 4.0.3. Additional information is available from Opto 22 here . CISA recommends users take defensive measures to minimize the risk of exploitation of this vulnerability, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the Internet . Locate control system networks and remote devices behind firewalls and isolate them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing that VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize that a VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. No known public exploitation specifically targeting this vulnerability has been reported to CISA at this time. This vulnerability has a high attack complexity. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  },
  {
    "title": "Automated Logic WebCTRL Premium Server",
    "url": "https://www.cisa.gov/news-events/ics-advisories/icsa-25-324-01",
    "snippet": "View CSAF 1. EXECUTIVE SUMMARY CVSS v4 8.6 ATTENTION : Low attack complexity Vendor : Automated Logic Equipment : WebCTRL Premium Server Vulnerabilities : Open Redirect, Cross-site Scripting 2. RISK EVALUATION Successful exploitation of these vulnerabilities could allow a remote attacker to deceive a legitimate user into running malicious scripts or redirecting them to malicious websites. 3. TECHNICAL DETAILS 3.1 AFFECTED PRODUCTS The following Automated Logic products are affected: Automated Logic WebCTRL Server: Version 6.1 Automated Logic WebCTRL Server: Version 7.0 Automated Logic WebCTRL Server: Version 8.0 Automated Logic WebCTRL Server: Version 8.5 Carrier i-Vu: Version 6.1 Carrier i-Vu: Version 7.0 Carrier i-Vu: Version 8.0 Carrier i-Vu: Version 8.5 Automated Logic SiteScan Web: Version 6.1 Automated Logic SiteScan Web: Version 7.0 Automated Logic SiteScan Web: Version 8.0 Automated Logic SiteScan Web: Version 8.5 Automated Logic WebCTRL for OEMs: Version 6.1 Automated Logic WebCTRL for OEMs: Version 7.0 Automated Logic WebCTRL for OEMs: Version 8.0 Automated Logic WebCTRL for OEMs: Version 8.5 3.2 Vulnerability Overview 3.2.1 URL Redirection to Untrusted Site ('Open Redirect') CWE-601 This weakness occurs when an application accepts a user-supplied URL and redirects the user to that URL without proper validation. Attackers can exploit this to redirect victims to malicious sites, often used in phishing or to bypass security controls. CVE-2024-8527 has been assigned to this vulnerability. A CVSS v3.1 base score of 9.3 has been calculated; the CVSS vector string is ( AV:L/AC:L/PR:N/UI:N/S:C/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2024-8527 . A base score of 8.6 has been calculated; the CVSS vector string is ( CVSS4.0/AV:L/AC:L/AT:N/PR:N/UI:N/VC:H/VI:H/VA:H/SC:L/SI:L/SA:L ). 3.2.2 Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting') CWE-79 Automated Logic WebCTRL could allow an attacker to send a malicious script to an unsuspecting user due to the \"wbs\" GET parameter not being sanitized. The application includes untrusted data in a web page without proper validation or escaping, allowing attackers to execute malicious scripts in the user's browser. CVE-2024-8528 has been assigned to this vulnerability. A CVSS v3.1 base score of 7.5 has been calculated; the CVSS vector string is ( AV:L/AC:H/PR:L/UI:R/S:C/C:H/I:H/A:H ). A CVSS v4 score has also been calculated for CVE-2024-8528 . A base score of 5.4 has been calculated; the CVSS vector string is ( CVSS4.0/AV:L/AC:H/AT:P/PR:L/UI:P/VC:H/VI:H/VA:H/SC:L/SI:L/SA:L ). 3.3 BACKGROUND CRITICAL INFRASTRUCTURE SECTORS: Critical Manufacturing COUNTRIES/AREAS DEPLOYED: Worldwide COMPANY HEADQUARTERS LOCATION: United States 3.4 RESEARCHER Jaryl Low, Thuy D. Nguyen, and Cynthia E. Irvine reported these vulnerabilities to CISA. 4. MITIGATIONS Automated Logic has reported the following: Users are advised to upgrade to the latest available version. These vulnerabilities have been remediated in Web CTRL 9.0. Web CTRL 7.0, Web CTRL 6.1, i-Vu 6.0 are out of support. Additionally, Users are encouraged to follow Automated Logic's [Security Best Practices Checklists for Building Automation Systems (BAS)]( https://www.automatedlogic.com/en/media/Security Best Practices for a WebCTRL v8.0 system-522_tcm702-168128.pdf) to ensure alignment with best practices installation guidelines. For more information, visit Carrier's security advisories: https://www.corporate.carrier.com/product-security/advisories-resources/ CISA recommends users take defensive measures to minimize the risk of exploitation of these vulnerabilities, such as: Minimize network exposure for all control system devices and/or systems, ensuring they are not accessible from the internet . Locate control system networks and remote devices behind firewalls and isolating them from business networks. When remote access is required, use more secure methods, such as Virtual Private Networks (VPNs), recognizing VPNs may have vulnerabilities and should be updated to the most current version available. Also recognize VPN is only as secure as the connected devices. CISA reminds organizations to perform proper impact analysis and risk assessment prior to deploying defensive measures. CISA also provides a section for control systems security recommended practices on the ICS webpage on cisa.gov/ics . Several CISA products detailing cyber defense best practices are available for reading and download, including Improving Industrial Control Systems Cybersecurity with Defense-in-Depth Strategies . CISA encourages organizations to implement recommended cybersecurity strategies for proactive defense of ICS assets . Additional mitigation guidance and recommended practices are publicly available on the ICS webpage at cisa.gov/ics in the technical information paper, ICS-TIP-12-146-01B--Targeted Cyber Intrusion Detection and Mitigation Strategies . Organizations observing suspected malicious activity should follow established internal procedures and report findings to CISA for tracking and correlation against other incidents. CISA also recommends users take the following measures to protect themselves from social engineering attacks: Do not click web links or open attachments in unsolicited email messages. Refer to Recognizing and Avoiding Email Scams for more information on avoiding email scams. Refer to Avoiding Social Engineering and Phishing Attacks for more information on social engineering attacks. No known public exploitation specifically targeting these vulnerabilities has been reported to CISA at this time. This vulnerability is not exploitable remotely. 5. UPDATE HISTORY November 20, 2025: Initial Publication",
    "source": "cisa.gov",
    "time": "2025-11-20T12:00:00",
    "region": "Global",
    "severity": 2,
    "type": "CYBER SECURITY"
  }
]